MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM364F10FG/mcu.h
/******************************************************************************
 * @file:    TMPM364.h
 * @purpose: CMSIS Cortex-M3 Core Peripheral Access Layer Header File for the 
 *           TOSHIBA 'TMPM364' Device Series 
 * @version: V2.0.2.5 (Tentative)
 * @date:    2010/06/25
 * 
 * THE SOURCE CODE AND ITS RELATED DOCUMENTATION IS PROVIDED "AS IS". TOSHIBA
 * CORPORATION MAKES NO OTHER WARRANTY OF ANY KIND, WHETHER EXPRESS, IMPLIED OR,
 * STATUTORY AND DISCLAIMS ANY AND ALL IMPLIED WARRANTIES OF MERCHANTABILITY,
 * SATISFACTORY QUALITY, NON INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
 * 
 * THE SOURCE CODE AND DOCUMENTATION MAY INCLUDE ERRORS. TOSHIBA CORPORATION
 * RESERVES THE RIGHT TO INCORPORATE MODIFICATIONS TO THE SOURCE CODE IN LATER
 * REVISIONS OF IT, AND TO MAKE IMPROVEMENTS OR CHANGES IN THE DOCUMENTATION OR
 * THE PRODUCTS OR TECHNOLOGIES DESCRIBED THEREIN AT ANY TIME.
 * 
 * TOSHIBA CORPORATION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
 * CONSEQUENTIAL DAMAGE OR LIABILITY ARISING FROM YOUR USE OF THE SOURCE CODE OR
 * ANY DOCUMENTATION, INCLUDING BUT NOT LIMITED TO, LOST REVENUES, DATA OR
 * PROFITS, DAMAGES OF ANY SPECIAL, INCIDENTAL OR CONSEQUENTIAL NATURE, PUNITIVE
 * DAMAGES, LOSS OF PROPERTY OR LOSS OF PROFITS ARISING OUT OF OR IN CONNECTION
 * WITH THIS AGREEMENT, OR BEING UNUSABLE, EVEN IF ADVISED OF THE POSSIBILITY OR
 * PROBABILITY OF SUCH DAMAGES AND WHETHER A CLAIM FOR SUCH DAMAGE IS BASED UPON
 * WARRANTY, CONTRACT, TORT, NEGLIGENCE OR OTHERWISE.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2010 All rights reserved
 ******************************************************************************/

/** @addtogroup TOSHIBA_TX03_MICROCONTROLLER
  * @{
  */

/** @addtogroup TMPM364
  * @{
  */

#ifndef __TMPM364_H__
#define __TMPM364_H__

#ifdef __cplusplus
extern "C" {
#endif 

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ****************************************************/
  NonMaskableInt_IRQn           = -14,      /*!< 2 Non Maskable Interrupt                          */
  HardFault_IRQn                = -13,      /*!< 3 Cortex-M3 Hard Fault Interrupt                  */
  MemoryManagement_IRQn         = -12,      /*!< 4 Cortex-M3 Memory Management Interrupt           */
  BusFault_IRQn                 = -11,      /*!< 5 Cortex-M3 Bus Fault Interrupt                   */
  UsageFault_IRQn               = -10,      /*!< 6 Cortex-M3 Usage Fault Interrupt                 */
  SVCall_IRQn                   = -5,       /*!< 11 Cortex-M3 SV Call Interrupt                    */
  DebugMonitor_IRQn             = -4,       /*!< 12 Cortex-M3 Debug Monitor Interrupt              */
  PendSV_IRQn                   = -2,       /*!< 14 Cortex-M3 Pend SV Interrupt                    */
  SysTick_IRQn                  = -1,       /*!< 15 Cortex-M3 System Tick Interrupt                */

/******  TMPM364 Specific Interrupt Numbers ********************************************************/
  INT0_IRQn                     = 0,        /*!< Interrupt pin 0                                   */
  INT1_IRQn                     = 1,        /*!< Interrupt pin 1                                   */
  INT2_IRQn                     = 2,        /*!< Interrupt pin 2                                   */
  INT3_IRQn                     = 3,        /*!< Interrupt pin 3                                   */
  INT4_IRQn                     = 4,        /*!< Interrupt pin 4                                   */
  INT5_IRQn                     = 5,        /*!< Interrupt pin 5                                   */
  INT6_IRQn                     = 6,        /*!< Interrupt pin 6                                   */
  INT7_IRQn                     = 7,        /*!< Interrupt pin 7                                   */
  INT8_IRQn                     = 8,        /*!< Interrupt pin 8                                   */
  INT9_IRQn                     = 9,        /*!< Interrupt pin 9                                   */
  INTA_IRQn                     = 10,       /*!< Interrupt pin A                                   */
  INTB_IRQn                     = 11,       /*!< Interrupt pin B                                   */
  INTC_IRQn                     = 12,       /*!< Interrupt pin C                                   */
  INTD_IRQn                     = 13,       /*!< Interrupt pin D                                   */
  INTRX0_IRQn                   = 16,       /*!< Serial reception (channel.0)                      */
  INTTX0_IRQn                   = 17,       /*!< Serial transmission (channel.0)                   */
  INTRX1_IRQn                   = 18,       /*!< Serial reception (channel.1)                      */
  INTTX1_IRQn                   = 19,       /*!< Serial transmission (channel.1)                   */
  INTRX2_IRQn                   = 20,       /*!< Serial reception (channel.2)                      */
  INTTX2_IRQn                   = 21,       /*!< Serial transmission (channel.2)                   */
  INTRX3_IRQn                   = 22,       /*!< Serial reception (channel.3)                      */
  INTTX3_IRQn                   = 23,       /*!< Serial transmission (channel.3)                   */
  INTRX4_IRQn                   = 24,       /*!< Serial reception (channel.4)                      */
  INTTX4_IRQn                   = 25,       /*!< Serial transmission (channel.4)                   */
  INTSBI0_IRQn                  = 26,       /*!< Serial bus interface (channel.0)                  */
  INTSBI1_IRQn                  = 27,       /*!< Serial bus interface (channel.1)                  */
  INTCECRX_IRQn                 = 28,       /*!< CEC reception                                     */
  INTCECTX_IRQn                 = 29,       /*!< CEC transmission                                  */
  INTRMCRX0_IRQn                = 30,       /*!< Remote control signal reception (channel.0)       */
  INTRMCRX1_IRQn                = 31,       /*!< Remote control signal reception (channel.1)       */
  INTRTC_IRQn                   = 32,       /*!< Real time clock timer                             */
  INTKWUP_IRQn                  = 33,       /*!< Key on wake up                                    */
  INTSBI2_IRQn                  = 34,       /*!< Serial bus interface (channel.2)                  */
  INTSBI3_IRQn                  = 35,       /*!< Serial bus interface (channel.3)                  */
  INTSBI4_IRQn                  = 36,       /*!< Serial bus interface (channel.4)                  */
  INTADHP_IRQn                  = 37,       /*!< Highest priority AD conversion complete interrupt */
  INTADM0_IRQn                  = 38,       /*!< AD conversion monitoring function interrupt 0     */
  INTADM1_IRQn                  = 39,       /*!< AD conversion monitoring function interrupt 1     */
  INTTB0_IRQn                   = 40,       /*!< 16bit TMRB match detection 0                      */
  INTTB1_IRQn                   = 41,       /*!< 16bit TMRB match detection 1                      */
  INTTB2_IRQn                   = 42,       /*!< 16bit TMRB match detection 2                      */
  INTTB3_IRQn                   = 43,       /*!< 16bit TMRB match detection 3                      */
  INTTB4_IRQn                   = 44,       /*!< 16bit TMRB match detection 4                      */
  INTTB5_IRQn                   = 45,       /*!< 16bit TMRB match detection 5                      */
  INTTB6_IRQn                   = 46,       /*!< 16bit TMRB match detection 6                      */
  INTTB7_IRQn                   = 47,       /*!< 16bit TMRB match detection 7                      */
  INTTB8_IRQn                   = 48,       /*!< 16bit TMRB match detection 8                      */
  INTTB9_IRQn                   = 49,       /*!< 16bit TMRB match detection 9                      */
  INTTBA_IRQn                   = 50,       /*!< 16bit TMRB match detection A                      */
  INTTBB_IRQn                   = 51,       /*!< 16bit TMRB match detection B                      */
  INTTBC_IRQn                   = 52,       /*!< 16bit TMRB match detection C                      */
  INTTBD_IRQn                   = 53,       /*!< 16bit TMRB match detection D                      */
  INTTBE_IRQn                   = 54,       /*!< 16bit TMRB match detection E                      */
  INTTBF_IRQn                   = 55,       /*!< 16bit TMRB match detection F                      */
  INTUSB_IRQn                   = 56,       /*!< USB                                               */
  INTCANSTA_IRQn                = 57,       /*!< CAN STATUS                                        */
  INTAD_IRQn                    = 58,       /*!< ADC conversion completion                         */
  INTSSP_IRQn                   = 59,       /*!< Synchronous Serial Port                           */
  INTRX5_IRQn                   = 60,       /*!< Serial reception (channel.5)                      */
  INTTX5_IRQn                   = 61,       /*!< Serial transmission (channel.5)                   */
  INTRX6_IRQn                   = 62,       /*!< Serial reception (channel.6)                      */
  INTTX6_IRQn                   = 63,       /*!< Serial transmission (channel.6)                   */
  INTRX7_IRQn                   = 64,       /*!< Serial reception (channel.7)                      */
  INTTX7_IRQn                   = 65,       /*!< Serial transmission (channel.7)                   */
  INTRX8_IRQn                   = 66,       /*!< Serial reception (channel.8)                      */
  INTTX8_IRQn                   = 67,       /*!< Serial transmission (channel.8)                   */
  INTRX9_IRQn                   = 68,       /*!< Serial reception (channel.9)                      */
  INTTX9_IRQn                   = 69,       /*!< Serial transmission (channel.9)                   */
  INTRX10_IRQn                  = 70,       /*!< Serial reception (channel.10)                     */
  INTTX10_IRQn                  = 71,       /*!< Serial transmission (channel.10)                  */
  INTRX11_IRQn                  = 72,       /*!< Serial reception (channel.11)                     */
  INTTX11_IRQn                  = 73,       /*!< Serial transmission (channel.11)                  */
  INTCAP10_IRQn                 = 74,       /*!< 16bit TMRB input capture 10                       */
  INTCAP11_IRQn                 = 75,       /*!< 16bit TMRB input capture 11                       */
  INTCAP20_IRQn                 = 76,       /*!< 16bit TMRB input capture 20                       */
  INTCAP21_IRQn                 = 77,       /*!< 16bit TMRB input capture 21                       */
  INTCANRX_IRQn                 = 78,       /*!< CAN RX                                            */
  INTCANTX_IRQn                 = 79,       /*!< CAN TX                                            */
  INTCAP50_IRQn                 = 80,       /*!< 16bit TMRB input capture 50                       */
  INTCAP51_IRQn                 = 81,       /*!< 16bit TMRB input capture 51                       */
  INTCAP60_IRQn                 = 82,       /*!< 16bit TMRB input capture 60                       */
  INTCAP61_IRQn                 = 83,       /*!< 16bit TMRB input capture 61                       */
  INTCAP70_IRQn                 = 84,       /*!< 16bit TMRB input capture 70                       */
  INTCAP71_IRQn                 = 85,       /*!< 16bit TMRB input capture 71                       */
  INTCAP90_IRQn                 = 86,       /*!< 16bit TMRB input capture 90                       */
  INTCAP91_IRQn                 = 87,       /*!< 16bit TMRB input capture 91                       */
  INTCAPA0_IRQn                 = 88,       /*!< 16bit TMRB input capture A0                       */
  INTCAPA1_IRQn                 = 89,       /*!< 16bit TMRB input capture A1                       */
  INTCAPB0_IRQn                 = 90,       /*!< 16bit TMRB input capture B0                       */
  INTCAPB1_IRQn                 = 91,       /*!< 16bit TMRB input capture B1                       */
  INTCAPD0_IRQn                 = 92,       /*!< 16bit TMRB input capture D0                       */
  INTCAPD1_IRQn                 = 93,       /*!< 16bit TMRB input capture D1                       */
  INTCAPE0_IRQn                 = 94,       /*!< 16bit TMRB input capture E0                       */
  INTCAPE1_IRQn                 = 95,       /*!< 16bit TMRB input capture E1                       */
  INTCAPF0_IRQn                 = 96,       /*!< 16bit TMRB input capture F0                       */
  INTCAPF1_IRQn                 = 97,       /*!< 16bit TMRB input capture F1                       */
  INTDMACERR_IRQn               = 98,       /*!< DMA transmission error                            */
  INTDMACTC0_IRQn               = 99        /*!< DMA transmission completion                       */
} IRQn_Type;


