MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM364F10FG/mcu.h
/** Processor and Core Peripheral Section */

/* Configuration of the Cortex-M3 Processor and Core Peripherals */
#define __CM3_REV              0x0200       /*!< Cortex-M3 Core Revision                           */
#define __MPU_PRESENT             0         /*!< MPU present or not                                */
#define __NVIC_PRIO_BITS          3         /*!< Number of Bits used for Priority Levels           */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used      */

/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm3.h"                       /* Cortex-M3 processor and core peripherals            */
// Note: Changed for MikroE implementation.
// #include "system_TMPM364.h"                 /* TMPM364 System                                      */

/** @addtogroup Device_Peripheral_registers
  * @{
  */

/** Device Specific Peripheral registers structures */

/**
  * @brief Single Master DMAC (DMAC)
  */
typedef struct
{
  __I  uint32_t INTSTATUS;             /*!< DMAC Interrupt Status Register                    */
  __I  uint32_t INTTCSTATUS;           /*!< DMAC Interrupt Terminal Count Status Register     */
  __O  uint32_t INTTCCLEAR;            /*!< DMAC Interrupt Terminal Count Clear Register      */
  __I  uint32_t INTERRORSTATUS;        /*!< DMAC Interrupt Error Status Register              */
  __O  uint32_t INTERRCLR;             /*!< DMAC Interrupt Error Clear Register               */
  __I  uint32_t RAWINTTCSTATUS;        /*!< DMAC Raw Interrupt Terminal Count Status Register */
  __I  uint32_t RAWINTERRORSTATUS;     /*!< DMAC Raw Error Interrupt Status Register          */
  __I  uint32_t ENBLDCHNS;             /*!< DMAC Enabled Channel Register                     */
  __IO uint32_t SOFTBREQ;              /*!< DMAC Software Burst Request Register              */
  __IO uint32_t SOFTSREQ;              /*!< DMAC Software Single Request Register             */
       uint32_t RESERVED0[2];
  __IO uint32_t CONFIGURATION;         /*!< DMAC Configuration Register                       */
       uint32_t RESERVED1[51];
  __IO uint32_t C0SRCADDR;             /*!< DMAC Channel0 Source Address Register             */
  __IO uint32_t C0DESTADDR;            /*!< DMAC Channel0 Destination Address Register        */
  __IO uint32_t C0LLI;                 /*!< DMAC Channel0 Linked List Item Register           */
  __IO uint32_t C0CONTROL;             /*!< DMAC Channel0 Control Register                    */
  __IO uint32_t C0CONFIGURATION;       /*!< DMAC Channel0 Configuration Register              */
       uint32_t RESERVED2[3];
  __IO uint32_t C1SRCADDR;             /*!< DMAC Channel1 Source Address Register             */
  __IO uint32_t C1DESTADDR;            /*!< DMAC Channel1 Destination Address Register        */
  __IO uint32_t C1LLI;                 /*!< DMAC Channel1 Linked List Item Register           */
  __IO uint32_t C1CONTROL;             /*!< DMAC Channel1 Control Register                    */
  __IO uint32_t C1CONFIGURATION;       /*!< DMAC Channel1 Configuration Register              */
} TSB_DMAC_TypeDef;

/**
  * @brief Static Memory Controller (SMC)
  */
typedef struct
{
       uint32_t RESERVED0;
  __I  uint32_t MEMIF_CFG;       /*!< SMC Memory Interface Configuration Register */
       uint32_t RESERVED1[2];
  __O  uint32_t DIRECT_CMD;      /*!< SMC Direct Command Register                 */
  __O  uint32_t SET_CYCLES;      /*!< SMC Set Cycles Register                     */
  __O  uint32_t SET_OPMODE;      /*!< SMC Set Opmode Register                     */
       uint32_t RESERVED2[57];
  __I  uint32_t SRAM_CYCLES0_0;  /*!< SMC SRAM Cycles Register 0 <0>              */
  __I  uint32_t OPMODE0_0;       /*!< SMC Opmode Register 0 <0>                   */
       uint32_t RESERVED3[6];
  __I  uint32_t SRAM_CYCLES0_1;  /*!< SMC SRAM Cycles Register 0 <1>              */
  __I  uint32_t OPMODE0_1;       /*!< SMC Opmode Register 0 <1>                   */
       uint32_t RESERVED4[6];
  __I  uint32_t SRAM_CYCLES0_2;  /*!< SMC SRAM Cycles Register 0 <2>              */
  __I  uint32_t OPMODE0_2;       /*!< SMC Opmode Register 0 <2>                   */
       uint32_t RESERVED5[6];
  __I  uint32_t SRAM_CYCLES0_3;  /*!< SMC SRAM Cycles Register 0 <3>              */
  __I  uint32_t OPMODE0_3;       /*!< SMC Opmode Register 0 <3>                   */
} TSB_SMC_TypeDef;

/**
  * @brief CAN Controller (TXCAN) Mailbox RAM
  */
typedef struct
{
  __IO uint32_t ID;                    /*!< CAN Mailbox ID                                        */
       uint32_t RESERVED0;
  __IO uint32_t TSVMCF;                /*!< CAN Mailbox Time Stamp Value & Message Control Field  */
       uint32_t RESERVED1;
  __IO uint32_t DL;                    /*!< CAN Mailbox Lower Data Field (D3-D0)                  */
       uint32_t RESERVED2;
  __IO uint32_t DH;                    /*!< CAN Mailbox Upper Data Field (D7-D4)                  */
} TSB_CANMB_TypeDef;

/**
  * @brief CAN Controller (TXCAN)
  */
typedef struct
{
  __IO uint32_t MC;                    /*!< CAN Mailbox Configuration Register            */
       uint32_t RESERVED0;
  __IO uint32_t MD;                    /*!< CAN Mailbox Direction Register                */
       uint32_t RESERVED1;
  __IO uint32_t TRS;                   /*!< CAN Transmit Request Set Register             */
       uint32_t RESERVED2;
  __IO uint32_t TRR;                   /*!< CAN Transmit Request Reset Register           */
       uint32_t RESERVED3;
  __IO uint32_t TA;                    /*!< CAN Transmission Acknowledge Register         */
       uint32_t RESERVED4;
  __IO uint32_t AA;                    /*!< CAN Abort Acknowledge Register                */
       uint32_t RESERVED5;
  __IO uint32_t RMP;                   /*!< CAN Receive Message Pending Register          */
       uint32_t RESERVED6;
  __IO uint32_t RML;                   /*!< CAN Receive Message Lost Register             */
       uint32_t RESERVED7;
  __IO uint32_t LAM;                   /*!< CAN Local Acceptance Mask Register            */
       uint32_t RESERVED8;
  __IO uint32_t GAM;                   /*!< CAN Global Acceptance Mask Register           */
       uint32_t RESERVED9;
  __IO uint32_t MCR;                   /*!< CAN Master Control Register                   */
       uint32_t RESERVED10;
  __I  uint32_t GSR;                   /*!< CAN Global Status Register                    */
       uint32_t RESERVED11;
  __IO uint32_t BCR1;                  /*!< CAN Bit Configuration Register 1              */
       uint32_t RESERVED12;
  __IO uint32_t BCR2;                  /*!< CAN Bit Configuration Register 2              */
       uint32_t RESERVED13;
  __IO uint32_t GIF;                   /*!< CAN Global Interrupt Flag Register            */
       uint32_t RESERVED14;
  __IO uint32_t GIM;                   /*!< CAN Global Interrupt Mask Register            */
       uint32_t RESERVED15;
  __IO uint32_t MBTIF;                 /*!< CAN Mailbox Transmit Interrupt Flag Register  */
       uint32_t RESERVED16;
  __IO uint32_t MBRIF;                 /*!< CAN Mailbox Receive Interrupt Flag Register   */
       uint32_t RESERVED17;
  __IO uint32_t MBIM;                  /*!< CAN Mailbox Interrupt Mask Register           */
       uint32_t RESERVED18;
  __IO uint32_t CDR;                   /*!< CAN Change Data Request                       */
       uint32_t RESERVED19;
  __IO uint32_t RFP;                   /*!< CAN Remote Frame Pending Register             */
       uint32_t RESERVED20;
  __I  uint32_t CECR;                  /*!< CAN CAN Error Counter Register                */
       uint32_t RESERVED21;
  __IO uint32_t TSP;                   /*!< CAN Time Stamp Counter Prescaler              */
       uint32_t RESERVED22;
  __IO uint32_t TSC;                   /*!< CAN Time Stamp Counter                        */
} TSB_CAN_TypeDef;

/**
  * @brief USB Host Controller
  */
typedef struct
{
  __I  uint32_t REVISION;              /*!< USB Host Controller Revision Register                    */
  __IO uint32_t CONTROL;               /*!< USB Host Controller Control Register                     */
  __IO uint32_t COMMANDSTATUS;         /*!< USB Host Controller Command Status Register              */
  __IO uint32_t INTERRUPTSTATUS;       /*!< USB Host Controller Interrupt Status Register            */
  __IO uint32_t INTERRUPTENABLE;       /*!< USB Host Controller Interrupt Enable Register            */
  __IO uint32_t INTERRUPTDISABLE;      /*!< USB Host Controller Interrupt Disable Register           */
  __IO uint32_t HCCA;                  /*!< USB Host Controller Communication Area Register          */
  __I  uint32_t PERIODCURRENTED;       /*!< USB Host Controller Period Current ED Register           */
  __IO uint32_t CONTROLHEADED;         /*!< USB Host Controller Control Head ED Register             */
  __IO uint32_t CONTROLCURRENTED;      /*!< USB Host Controller Control Current ED Register          */
  __IO uint32_t BULKHEADED;            /*!< USB Host Controller Bulk Head ED Register                */
  __IO uint32_t BULKCURRENTED;         /*!< USB Host Controller Bulk Current ED Register             */
  __I  uint32_t DONEHEAD;              /*!< USB Host Controller Done Head Register                   */
  __IO uint32_t FMINTERVAL;            /*!< USB Host Controller Frame Interval Register              */
  __I  uint32_t FMREMAINING;           /*!< USB Host Controller Frame Remaining Register             */
  __I  uint32_t FMNUMBER;              /*!< USB Host Controller Frame Number Register                */
  __IO uint32_t PERIODSTART;           /*!< USB Host Controller Period Start Register                */
  __IO uint32_t LSTHRESHOLD;           /*!< USB Host Controller LS Threshold Register                */
  __IO uint32_t RHDESCRIPTORA;         /*!< USB Host Controller Root Hub Descriptor Register         */
  __IO uint32_t RHDESCRIPTERB;         /*!< USB Host Controller Root Hub Descriptor Register         */
  __IO uint32_t RHSTATUS;              /*!< USB Host Controller Root Hub Status Register             */
  __IO uint32_t RHPORTSTATUS;          /*!< USB Host Controller Root Hub Port Status Register        */
       uint32_t RESERVED0[10];
  __IO uint32_t BCR0;                  /*!< USB Host Controller Clock & Transceiver Control Register */
} TSB_HC_TypeDef;

/**
  * @brief Synchronous Serial Port (SSP)
  */
typedef struct
{
  __IO uint32_t CR0;            /*!< SSP Control Register 0                    */
  __IO uint32_t CR1;            /*!< SSP Control Register 1                    */
  __IO uint32_t DR;             /*!< SSP Data Register                         */
  __I  uint32_t SR;             /*!< SSP Status Register                       */
  __IO uint32_t CPSR;           /*!< SSP Clock Prescaler Register              */
  __IO uint32_t IMSC;           /*!< SSP Interrupt Mask Set and Clear Register */
  __I  uint32_t RIS;            /*!< SSP Raw Interrupt Status Register         */
  __I  uint32_t MIS;            /*!< SSP Masked Interrupt Status Register      */
  __O  uint32_t ICR;            /*!< SSP Interrupt Clear Register              */
  __IO uint32_t DMACR;          /*!< SSP DMA Control Register                  */
} TSB_SSP_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PA)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PA Data Register                 */
  __IO uint32_t CR;             /*!< PA Control Register              */
  __IO uint32_t FR1;            /*!< PA Function Register 1           */
       uint32_t RESERVED0[7];
  __IO uint32_t OD;             /*!< PA Open Drain Control Register   */
  __IO uint32_t PUP;            /*!< PA Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;             /*!< PA Input Enable Control Register */
} TSB_PA_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PB)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PB Data Register                 */
  __IO uint32_t CR;             /*!< PB Control Register              */
  __IO uint32_t FR1;            /*!< PB Function Register 1           */
       uint32_t RESERVED0[7];
  __IO uint32_t OD;             /*!< PB Open Drain Control Register   */
  __IO uint32_t PUP;            /*!< PB Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;             /*!< PB Input Enable Control Register */
} TSB_PB_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PC)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PC Data Register                 */
  __IO uint32_t CR;             /*!< PC Control Register              */
  __IO uint32_t FR1;            /*!< PC Function Register 1           */
  __IO uint32_t FR2;            /*!< PC Function Register 2           */
  __IO uint32_t FR3;            /*!< PC Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;             /*!< PC Open Drain Control Register   */
  __IO uint32_t PUP;            /*!< PC Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;             /*!< PC Input Enable Control Register */
} TSB_PC_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PD)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PD Data Register                 */
  __IO uint32_t CR;             /*!< PD Control Register              */
  __IO uint32_t FR1;            /*!< PD Function Register 1           */
  __IO uint32_t FR2;            /*!< PD Function Register 2           */
  __IO uint32_t FR3;            /*!< PD Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;             /*!< PD Open Drain Control Register   */
  __IO uint32_t PUP;            /*!< PD Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;             /*!< PD Input Enable Control Register */
} TSB_PD_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PE)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PE Data Register                 */
  __IO uint32_t CR;             /*!< PE Control Register              */
  __IO uint32_t FR1;            /*!< PE Function Register 1           */
  __IO uint32_t FR2;            /*!< PE Function Register 2           */
  __IO uint32_t FR3;            /*!< PE Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;             /*!< PE Open Drain Control Register   */
  __IO uint32_t PUP;            /*!< PE Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;             /*!< PE Input Enable Control Register */
} TSB_PE_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PF)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PF Data Register                 */
  __IO uint32_t CR;             /*!< PF Control Register              */
  __IO uint32_t FR1;            /*!< PF Function Register 1           */
       uint32_t RESERVED0[7];
  __IO uint32_t OD;             /*!< PF Open Drain Control Register   */
  __IO uint32_t PUP;            /*!< PF Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;             /*!< PF Input Enable Control Register */
} TSB_PF_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PG)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PG Data Register                 */
  __IO uint32_t CR;             /*!< PG Control Register              */
  __IO uint32_t FR1;            /*!< PG Function Register 1           */
  __IO uint32_t FR2;            /*!< PG Function Register 2           */
  __IO uint32_t FR3;            /*!< PG Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;             /*!< PG Open Drain Control Register   */
  __IO uint32_t PUP;            /*!< PG Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;             /*!< PG Input Enable Control Register */
} TSB_PG_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PH)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PH Data Register                 */
  __IO uint32_t CR;             /*!< PH Control Register              */
  __IO uint32_t FR1;            /*!< PH Function Register 1           */
  __IO uint32_t FR2;            /*!< PH Function Register 2           */
       uint32_t RESERVED0[6];
  __IO uint32_t OD;             /*!< PH Open Drain Control Register   */
  __IO uint32_t PUP;            /*!< PH Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;             /*!< PH Input Enable Control Register */
} TSB_PH_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PI)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PI Data Register                 */
  __IO uint32_t CR;             /*!< PI Control Register              */
  __IO uint32_t FR1;            /*!< PI Function Register 1           */
       uint32_t RESERVED0[7];
  __IO uint32_t OD;             /*!< PI Open Drain Control Register   */
  __IO uint32_t PUP;            /*!< PI Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;             /*!< PI Input Enable Control Register */
} TSB_PI_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PJ)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PJ Data Register                 */
       uint32_t RESERVED0[2];
  __IO uint32_t FR2;            /*!< PJ Function Register 2           */
       uint32_t RESERVED1[7];
  __IO uint32_t PUP;            /*!< PJ Pull-Up Control Register      */
       uint32_t RESERVED2[2];
  __IO uint32_t IE;             /*!< PJ Input Enable Control Register */
} TSB_PJ_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PK)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PK Data Register                 */
       uint32_t RESERVED0[10];
  __IO uint32_t PUP;            /*!< PK Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;             /*!< PK Input Enable Control Register */
} TSB_PK_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PL)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PL Data Register                 */
  __IO uint32_t CR;             /*!< PL Control Register              */
  __IO uint32_t FR1;            /*!< PL Function Register 1           */
  __IO uint32_t FR2;            /*!< PL Function Register 2           */
  __IO uint32_t FR3;            /*!< PL Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;             /*!< PL Open Drain Control Register   */
  __IO uint32_t PUP;            /*!< PL Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;             /*!< PL Input Enable Control Register */
} TSB_PL_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PM)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PM Data Register                 */
  __IO uint32_t CR;             /*!< PM Control Register              */
  __IO uint32_t FR1;            /*!< PM Function Register 1           */
  __IO uint32_t FR2;            /*!< PM Function Register 2           */
  __IO uint32_t FR3;            /*!< PM Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;             /*!< PM Open Drain Control Register   */
  __IO uint32_t PUP;            /*!< PM Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;             /*!< PM Input Enable Control Register */
} TSB_PM_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PN)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PN Data Register                 */
  __IO uint32_t CR;             /*!< PN Control Register              */
  __IO uint32_t FR1;            /*!< PN Function Register 1           */
  __IO uint32_t FR2;            /*!< PN Function Register 2           */
  __IO uint32_t FR3;            /*!< PN Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;             /*!< PN Open Drain Control Register   */
  __IO uint32_t PUP;            /*!< PN Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;             /*!< PN Input Enable Control Register */
} TSB_PN_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PO)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PO Data Register                 */
  __IO uint32_t CR;             /*!< PO Control Register              */
  __IO uint32_t FR1;            /*!< PO Function Register 1           */
  __IO uint32_t FR2;            /*!< PO Function Register 2           */
  __IO uint32_t FR3;            /*!< PO Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;             /*!< PO Open Drain Control Register   */
  __IO uint32_t PUP;            /*!< PO Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;             /*!< PO Input Enable Control Register */
} TSB_PO_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PP)
  */
typedef struct
{
  __IO uint32_t DATA;           /*!< PP Data Register                 */
  __IO uint32_t CR;             /*!< PP Control Register              */
  __IO uint32_t FR1;            /*!< PP Function Register 1           */
  __IO uint32_t FR2;            /*!< PP Function Register 2           */
       uint32_t RESERVED0[6];
  __IO uint32_t OD;             /*!< PP Open Drain Control Register   */
  __IO uint32_t PUP;            /*!< PP Pull-Up Control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;             /*!< PP Input Enable Control Register */
} TSB_PP_TypeDef;

/**
  * @brief 16-bit Timer/Event Counter (TB)
  */
typedef struct
{
  __IO uint32_t EN;             /*!< TB Enable Register            */
  __IO uint32_t RUN;            /*!< TB RUN Register               */
  __IO uint32_t CR;             /*!< TB Control Register           */
  __IO uint32_t MOD;            /*!< TB Mode Register              */
  __IO uint32_t FFCR;           /*!< TB Flip-Flop Control Register */
  __I  uint32_t ST;             /*!< TB Status Register            */
  __IO uint32_t IM;             /*!< TB Interrupt Mask Register    */
  __I  uint32_t UC;             /*!< TB Read Capture Register      */
  __IO uint32_t RG0;            /*!< TB RG0 Timer Register         */
  __IO uint32_t RG1;            /*!< TB RG1 Timer Register         */
  __I  uint32_t CP0;            /*!< TB CP0 Capture Register       */
  __I  uint32_t CP1;            /*!< TB CP1 Capture Register       */
} TSB_TB_TypeDef;

#if defined ( __CC_ARM   )      /* RealView Compiler */
#pragma anon_unions 
#elif (defined (__ICCARM__)) 	/*ICC Compiler       */
#pragma language=extended
#endif

/**
  * @brief Serial Bus Interface (SBI)
  */
typedef struct
{
  __IO uint32_t CR0;            /*!< SBI Control Register 0       */
  __IO uint32_t CR1;            /*!< SBI Control Register 1       */
  __IO uint32_t DBR;            /*!< SBI Data Buffer Register     */
  __IO uint32_t I2CAR;          /*!< SBI I2C Bus Address Register */
  union {
  __O  uint32_t CR2;            /*!< SBI Control Register 2       */
  __I  uint32_t SR;             /*!< SBI Status Register          */
  };
  __IO uint32_t BR0;            /*!< SBI Baud Rate Register 0     */
} TSB_SBI_TypeDef;

