MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM364F10FG/mcu.h
#if defined ( __CC_ARM   )     /* RealView Compiler  */
#pragma no_anon_unions
#elif (defined (__ICCARM__))   /* ICC Compiler 	     */
#pragma language=default
#endif

/**
  * @brief Flash Control (FC)
  */
typedef struct
{
  __IO uint32_t SECBIT;          /*!< Security Bit Register   */
       uint32_t RESERVED0[3];
  __I  uint32_t FLCS;            /*!< FLASH Control Register  */
} TSB_FC_TypeDef;

/**
  * @brief RAM Controller (RAMC)
  */
typedef struct
{
  __IO uint32_t WAIT;           /*!< RAM WAIT Control Register */
} TSB_RC_TypeDef;

/**
  * @brief SMC MODE Register
  */
  
typedef struct
{
  __IO uint32_t MODE;            /*!< SMC MODE Register */
} TSB_SMCMD_TypeDef;

/* Memory map */
#define FLASH_BASE            (0x00000000UL)
#define RAM_BASE              (0x20000000UL)
#define PERI_BASE             (0x40000000UL)

#define TSB_DMAC_BASE             (PERI_BASE  + 0x00000UL)
#define TSB_SMC_BASE              (PERI_BASE  + 0x01000UL)
#define TSB_CANMB0_BASE           (PERI_BASE  + 0x02000UL)
#define TSB_CANMB1_BASE           (PERI_BASE  + 0x02020UL)
#define TSB_CANMB2_BASE           (PERI_BASE  + 0x02040UL)
#define TSB_CANMB3_BASE           (PERI_BASE  + 0x02060UL)
#define TSB_CANMB4_BASE           (PERI_BASE  + 0x02080UL)
#define TSB_CANMB5_BASE           (PERI_BASE  + 0x020A0UL)
#define TSB_CANMB6_BASE           (PERI_BASE  + 0x020C0UL)
#define TSB_CANMB7_BASE           (PERI_BASE  + 0x020E0UL)
#define TSB_CANMB8_BASE           (PERI_BASE  + 0x02100UL)
#define TSB_CANMB9_BASE           (PERI_BASE  + 0x02120UL)
#define TSB_CANMB10_BASE          (PERI_BASE  + 0x02140UL)
#define TSB_CANMB11_BASE          (PERI_BASE  + 0x02160UL)
#define TSB_CANMB12_BASE          (PERI_BASE  + 0x02180UL)
#define TSB_CANMB13_BASE          (PERI_BASE  + 0x021A0UL)
#define TSB_CANMB14_BASE          (PERI_BASE  + 0x021C0UL)
#define TSB_CANMB15_BASE          (PERI_BASE  + 0x021E0UL)
#define TSB_CANMB16_BASE          (PERI_BASE  + 0x02200UL)
#define TSB_CANMB17_BASE          (PERI_BASE  + 0x02220UL)
#define TSB_CANMB18_BASE          (PERI_BASE  + 0x02240UL)
#define TSB_CANMB19_BASE          (PERI_BASE  + 0x02260UL)
#define TSB_CANMB20_BASE          (PERI_BASE  + 0x02280UL)
#define TSB_CANMB21_BASE          (PERI_BASE  + 0x022A0UL)
#define TSB_CANMB22_BASE          (PERI_BASE  + 0x022C0UL)
#define TSB_CANMB23_BASE          (PERI_BASE  + 0x022E0UL)
#define TSB_CANMB24_BASE          (PERI_BASE  + 0x02300UL)
#define TSB_CANMB25_BASE          (PERI_BASE  + 0x02320UL)
#define TSB_CANMB26_BASE          (PERI_BASE  + 0x02340UL)
#define TSB_CANMB27_BASE          (PERI_BASE  + 0x02360UL)
#define TSB_CANMB28_BASE          (PERI_BASE  + 0x02380UL)
#define TSB_CANMB29_BASE          (PERI_BASE  + 0x023A0UL)
#define TSB_CANMB30_BASE          (PERI_BASE  + 0x023C0UL)
#define TSB_CANMB31_BASE          (PERI_BASE  + 0x023E0UL)
#define TSB_CAN_BASE              (PERI_BASE  + 0x02400UL)
#define TSB_HC_BASE               (PERI_BASE  + 0x03000UL)
#define TSB_SSP_BASE              (PERI_BASE  + 0x40000UL)
#define TSB_PA_BASE               (PERI_BASE  + 0xC0000UL)
#define TSB_PB_BASE               (PERI_BASE  + 0xC0100UL)
#define TSB_PC_BASE               (PERI_BASE  + 0xC0200UL)
#define TSB_PD_BASE               (PERI_BASE  + 0xC0300UL)
#define TSB_PE_BASE               (PERI_BASE  + 0xC0400UL)
#define TSB_PF_BASE               (PERI_BASE  + 0xC0500UL)
#define TSB_PG_BASE               (PERI_BASE  + 0xC0600UL)
#define TSB_PH_BASE               (PERI_BASE  + 0xC0700UL)
#define TSB_PI_BASE               (PERI_BASE  + 0xC0800UL)
#define TSB_PJ_BASE               (PERI_BASE  + 0xC0900UL)
#define TSB_PK_BASE               (PERI_BASE  + 0xC0A00UL)
#define TSB_PL_BASE               (PERI_BASE  + 0xC0B00UL)
#define TSB_PM_BASE               (PERI_BASE  + 0xC0C00UL)
#define TSB_PN_BASE               (PERI_BASE  + 0xC0D00UL)
#define TSB_PO_BASE               (PERI_BASE  + 0xC0E00UL)
#define TSB_PP_BASE               (PERI_BASE  + 0xC0F00UL)
#define TSB_TB0_BASE              (PERI_BASE  + 0xD0000UL)
#define TSB_TB1_BASE              (PERI_BASE  + 0xD0100UL)
#define TSB_TB2_BASE              (PERI_BASE  + 0xD0200UL)
#define TSB_TB3_BASE              (PERI_BASE  + 0xD0300UL)
#define TSB_TB4_BASE              (PERI_BASE  + 0xD0400UL)
#define TSB_TB5_BASE              (PERI_BASE  + 0xD0500UL)
#define TSB_TB6_BASE              (PERI_BASE  + 0xD0600UL)
#define TSB_TB7_BASE              (PERI_BASE  + 0xD0700UL)
#define TSB_TB8_BASE              (PERI_BASE  + 0xD0800UL)
#define TSB_TB9_BASE              (PERI_BASE  + 0xD0900UL)
#define TSB_TBA_BASE              (PERI_BASE  + 0xD0A00UL)
#define TSB_TBB_BASE              (PERI_BASE  + 0xD0B00UL)
#define TSB_TBC_BASE              (PERI_BASE  + 0xD0C00UL)
#define TSB_TBD_BASE              (PERI_BASE  + 0xD0D00UL)
#define TSB_TBE_BASE              (PERI_BASE  + 0xD0E00UL)
#define TSB_TBF_BASE              (PERI_BASE  + 0xD0F00UL)
#define TSB_SBI0_BASE             (PERI_BASE  + 0xE0000UL)
#define TSB_SBI1_BASE             (PERI_BASE  + 0xE0100UL)
#define TSB_SBI2_BASE             (PERI_BASE  + 0xE0200UL)
#define TSB_SBI3_BASE             (PERI_BASE  + 0xE0300UL)
#define TSB_SBI4_BASE             (PERI_BASE  + 0xE0400UL)
#define TSB_SC0_BASE              (PERI_BASE  + 0xE1000UL)
#define TSB_SC1_BASE              (PERI_BASE  + 0xE1100UL)
#define TSB_SC2_BASE              (PERI_BASE  + 0xE1200UL)
#define TSB_SC3_BASE              (PERI_BASE  + 0xE1300UL)
#define TSB_SC4_BASE              (PERI_BASE  + 0xE1400UL)
#define TSB_SC5_BASE              (PERI_BASE  + 0xE1500UL)
#define TSB_SC6_BASE              (PERI_BASE  + 0xE1600UL)
#define TSB_SC7_BASE              (PERI_BASE  + 0xE1700UL)
#define TSB_SC8_BASE              (PERI_BASE  + 0xE1800UL)
#define TSB_SC9_BASE              (PERI_BASE  + 0xE1900UL)
#define TSB_SC10_BASE             (PERI_BASE  + 0xE1A00UL)
#define TSB_SC11_BASE             (PERI_BASE  + 0xE1B00UL)
#define TSB_CEC_BASE              (PERI_BASE  + 0xE2000UL)
#define TSB_RMC0_BASE             (PERI_BASE  + 0xE3000UL)
#define TSB_RMC1_BASE             (PERI_BASE  + 0xE3100UL)
#define TSB_AD_BASE               (PERI_BASE  + 0xF0000UL)
#define TSB_KWUP_BASE             (PERI_BASE  + 0xF1000UL)
#define TSB_WD_BASE               (PERI_BASE  + 0xF2000UL)
#define TSB_RTC_BASE              (PERI_BASE  + 0xF3000UL)
#define TSB_CG_BASE               (PERI_BASE  + 0xF4000UL)
#define TSB_FC_BASE               (PERI_BASE  + 0x1FFF010UL)
#define TSB_RC_BASE               (PERI_BASE  + 0x1FFF058UL)
#define TSB_SMCMD_BASE            (PERI_BASE  + 0x1FFF100UL)

