MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM364F10FG/mcu.h
/* Peripheral declaration */
#define TSB_DMAC                  ((   TSB_DMAC_TypeDef *)     TSB_DMAC_BASE)
#define TSB_SMC                   ((    TSB_SMC_TypeDef *)      TSB_SMC_BASE)
#define TSB_CANMB0                ((  TSB_CANMB_TypeDef *)   TSB_CANMB0_BASE)
#define TSB_CANMB1                ((  TSB_CANMB_TypeDef *)   TSB_CANMB1_BASE)
#define TSB_CANMB2                ((  TSB_CANMB_TypeDef *)   TSB_CANMB2_BASE)
#define TSB_CANMB3                ((  TSB_CANMB_TypeDef *)   TSB_CANMB3_BASE)
#define TSB_CANMB4                ((  TSB_CANMB_TypeDef *)   TSB_CANMB4_BASE)
#define TSB_CANMB5                ((  TSB_CANMB_TypeDef *)   TSB_CANMB5_BASE)
#define TSB_CANMB6                ((  TSB_CANMB_TypeDef *)   TSB_CANMB6_BASE)
#define TSB_CANMB7                ((  TSB_CANMB_TypeDef *)   TSB_CANMB7_BASE)
#define TSB_CANMB8                ((  TSB_CANMB_TypeDef *)   TSB_CANMB8_BASE)
#define TSB_CANMB9                ((  TSB_CANMB_TypeDef *)   TSB_CANMB9_BASE)
#define TSB_CANMB10               ((  TSB_CANMB_TypeDef *)  TSB_CANMB10_BASE)
#define TSB_CANMB11               ((  TSB_CANMB_TypeDef *)  TSB_CANMB11_BASE)
#define TSB_CANMB12               ((  TSB_CANMB_TypeDef *)  TSB_CANMB12_BASE)
#define TSB_CANMB13               ((  TSB_CANMB_TypeDef *)  TSB_CANMB13_BASE)
#define TSB_CANMB14               ((  TSB_CANMB_TypeDef *)  TSB_CANMB14_BASE)
#define TSB_CANMB15               ((  TSB_CANMB_TypeDef *)  TSB_CANMB15_BASE)
#define TSB_CANMB16               ((  TSB_CANMB_TypeDef *)  TSB_CANMB16_BASE)
#define TSB_CANMB17               ((  TSB_CANMB_TypeDef *)  TSB_CANMB17_BASE)
#define TSB_CANMB18               ((  TSB_CANMB_TypeDef *)  TSB_CANMB18_BASE)
#define TSB_CANMB19               ((  TSB_CANMB_TypeDef *)  TSB_CANMB19_BASE)
#define TSB_CANMB20               ((  TSB_CANMB_TypeDef *)  TSB_CANMB20_BASE)
#define TSB_CANMB21               ((  TSB_CANMB_TypeDef *)  TSB_CANMB21_BASE)
#define TSB_CANMB22               ((  TSB_CANMB_TypeDef *)  TSB_CANMB22_BASE)
#define TSB_CANMB23               ((  TSB_CANMB_TypeDef *)  TSB_CANMB23_BASE)
#define TSB_CANMB24               ((  TSB_CANMB_TypeDef *)  TSB_CANMB24_BASE)
#define TSB_CANMB25               ((  TSB_CANMB_TypeDef *)  TSB_CANMB25_BASE)
#define TSB_CANMB26               ((  TSB_CANMB_TypeDef *)  TSB_CANMB26_BASE)
#define TSB_CANMB27               ((  TSB_CANMB_TypeDef *)  TSB_CANMB27_BASE)
#define TSB_CANMB28               ((  TSB_CANMB_TypeDef *)  TSB_CANMB28_BASE)
#define TSB_CANMB29               ((  TSB_CANMB_TypeDef *)  TSB_CANMB29_BASE)
#define TSB_CANMB30               ((  TSB_CANMB_TypeDef *)  TSB_CANMB30_BASE)
#define TSB_CANMB31               ((  TSB_CANMB_TypeDef *)  TSB_CANMB31_BASE)
#define TSB_CAN                   ((    TSB_CAN_TypeDef *)      TSB_CAN_BASE)
#define TSB_HC                    ((     TSB_HC_TypeDef *)       TSB_HC_BASE)
#define TSB_SSP                   ((    TSB_SSP_TypeDef *)      TSB_SSP_BASE)
#define TSB_PA                    ((     TSB_PA_TypeDef *)       TSB_PA_BASE)
#define TSB_PB                    ((     TSB_PB_TypeDef *)       TSB_PB_BASE)
#define TSB_PC                    ((     TSB_PC_TypeDef *)       TSB_PC_BASE)
#define TSB_PD                    ((     TSB_PD_TypeDef *)       TSB_PD_BASE)
#define TSB_PE                    ((     TSB_PE_TypeDef *)       TSB_PE_BASE)
#define TSB_PF                    ((     TSB_PF_TypeDef *)       TSB_PF_BASE)
#define TSB_PG                    ((     TSB_PG_TypeDef *)       TSB_PG_BASE)
#define TSB_PH                    ((     TSB_PH_TypeDef *)       TSB_PH_BASE)
#define TSB_PI                    ((     TSB_PI_TypeDef *)       TSB_PI_BASE)
#define TSB_PJ                    ((     TSB_PJ_TypeDef *)       TSB_PJ_BASE)
#define TSB_PK                    ((     TSB_PK_TypeDef *)       TSB_PK_BASE)
#define TSB_PL                    ((     TSB_PL_TypeDef *)       TSB_PL_BASE)
#define TSB_PM                    ((     TSB_PM_TypeDef *)       TSB_PM_BASE)
#define TSB_PN                    ((     TSB_PN_TypeDef *)       TSB_PN_BASE)
#define TSB_PO                    ((     TSB_PO_TypeDef *)       TSB_PO_BASE)
#define TSB_PP                    ((     TSB_PP_TypeDef *)       TSB_PP_BASE)
#define TSB_TB0                   ((     TSB_TB_TypeDef *)      TSB_TB0_BASE)
#define TSB_TB1                   ((     TSB_TB_TypeDef *)      TSB_TB1_BASE)
#define TSB_TB2                   ((     TSB_TB_TypeDef *)      TSB_TB2_BASE)
#define TSB_TB3                   ((     TSB_TB_TypeDef *)      TSB_TB3_BASE)
#define TSB_TB4                   ((     TSB_TB_TypeDef *)      TSB_TB4_BASE)
#define TSB_TB5                   ((     TSB_TB_TypeDef *)      TSB_TB5_BASE)
#define TSB_TB6                   ((     TSB_TB_TypeDef *)      TSB_TB6_BASE)
#define TSB_TB7                   ((     TSB_TB_TypeDef *)      TSB_TB7_BASE)
#define TSB_TB8                   ((     TSB_TB_TypeDef *)      TSB_TB8_BASE)
#define TSB_TB9                   ((     TSB_TB_TypeDef *)      TSB_TB9_BASE)
#define TSB_TBA                   ((     TSB_TB_TypeDef *)      TSB_TBA_BASE)
#define TSB_TBB                   ((     TSB_TB_TypeDef *)      TSB_TBB_BASE)
#define TSB_TBC                   ((     TSB_TB_TypeDef *)      TSB_TBC_BASE)
#define TSB_TBD                   ((     TSB_TB_TypeDef *)      TSB_TBD_BASE)
#define TSB_TBE                   ((     TSB_TB_TypeDef *)      TSB_TBE_BASE)
#define TSB_TBF                   ((     TSB_TB_TypeDef *)      TSB_TBF_BASE)
#define TSB_SBI0                  ((    TSB_SBI_TypeDef *)     TSB_SBI0_BASE)
#define TSB_SBI1                  ((    TSB_SBI_TypeDef *)     TSB_SBI1_BASE)
#define TSB_SBI2                  ((    TSB_SBI_TypeDef *)     TSB_SBI2_BASE)
#define TSB_SBI3                  ((    TSB_SBI_TypeDef *)     TSB_SBI3_BASE)
#define TSB_SBI4                  ((    TSB_SBI_TypeDef *)     TSB_SBI4_BASE)
#define TSB_SC0                   ((     TSB_SC_TypeDef *)      TSB_SC0_BASE)
#define TSB_SC1                   ((     TSB_SC_TypeDef *)      TSB_SC1_BASE)
#define TSB_SC2                   ((     TSB_SC_TypeDef *)      TSB_SC2_BASE)
#define TSB_SC3                   ((     TSB_SC_TypeDef *)      TSB_SC3_BASE)
#define TSB_SC4                   ((     TSB_SC_TypeDef *)      TSB_SC4_BASE)
#define TSB_SC5                   ((     TSB_SC_TypeDef *)      TSB_SC5_BASE)
#define TSB_SC6                   ((     TSB_SC_TypeDef *)      TSB_SC6_BASE)
#define TSB_SC7                   ((     TSB_SC_TypeDef *)      TSB_SC7_BASE)
#define TSB_SC8                   ((     TSB_SC_TypeDef *)      TSB_SC8_BASE)
#define TSB_SC9                   ((     TSB_SC_TypeDef *)      TSB_SC9_BASE)
#define TSB_SC10                  ((     TSB_SC_TypeDef *)     TSB_SC10_BASE)
#define TSB_SC11                  ((     TSB_SC_TypeDef *)     TSB_SC11_BASE)
#define TSB_CEC                   ((    TSB_CEC_TypeDef *)      TSB_CEC_BASE)
#define TSB_RMC0                  ((    TSB_RMC_TypeDef *)     TSB_RMC0_BASE)
#define TSB_RMC1                  ((    TSB_RMC_TypeDef *)     TSB_RMC1_BASE)
#define TSB_AD                    ((     TSB_AD_TypeDef *)       TSB_AD_BASE)
#define TSB_KWUP                  ((   TSB_KWUP_TypeDef *)     TSB_KWUP_BASE)
#define TSB_WD                    ((     TSB_WD_TypeDef *)       TSB_WD_BASE)
#define TSB_RTC                   ((    TSB_RTC_TypeDef *)      TSB_RTC_BASE)
#define TSB_CG                    ((     TSB_CG_TypeDef *)       TSB_CG_BASE)
#define TSB_FC                    ((     TSB_FC_TypeDef *)       TSB_FC_BASE)
#define TSB_RC                    ((     TSB_RC_TypeDef *)       TSB_RC_BASE)
#define TSB_SMCMD                 ((  TSB_SMCMD_TypeDef *)    TSB_SMCMD_BASE)

/* Bit-Band for Device Specific Peripheral Registers */
#define BITBAND_OFFSET (0x02000000UL)
#define BITBAND_PERI_BASE (PERI_BASE + BITBAND_OFFSET)
#define BITBAND_PERI(addr, bitnum) (BITBAND_PERI_BASE + (((uint32_t)(addr) - PERI_BASE) << 5) + ((uint32_t)(bitnum) << 2))

/* DMA Controller (DMAC) */
#define TSB_DMAC_INTSTATUS_INTSTATUS0           (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->INTSTATUS        ,0)))
#define TSB_DMAC_INTSTATUS_INTSTATUS1           (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->INTSTATUS        ,1)))
#define TSB_DMAC_INTTCSTATUS_INTTCSTATUS0       (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->INTTCSTATUS      ,0)))
#define TSB_DMAC_INTTCSTATUS_INTTCSTATUS1       (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->INTTCSTATUS      ,1)))
#define TSB_DMAC_INTERRORSTATUS_INTERRSTATUS0   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->INTERRORSTATUS   ,0)))
#define TSB_DMAC_INTERRORSTATUS_INTERRSTATUS1   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->INTERRORSTATUS   ,1)))
#define TSB_DMAC_RAWINTTCSTATUS_RAWINTTCS0      (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->RAWINTTCSTATUS   ,0)))
#define TSB_DMAC_RAWINTTCSTATUS_RAWINTTCS1      (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->RAWINTTCSTATUS   ,1)))
#define TSB_DMAC_RAWINTERRORSTATUS_RAWINTERRS0  (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->RAWINTERRORSTATUS,0)))
#define TSB_DMAC_RAWINTERRORSTATUS_RAWINTERRS1  (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->RAWINTERRORSTATUS,1)))
#define TSB_DMAC_ENBLDCHNS_ENABLEDCH0           (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->ENBLDCHNS        ,0)))
#define TSB_DMAC_ENBLDCHNS_ENABLEDCH1           (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->ENBLDCHNS        ,1)))
#define TSB_DMAC_C0CONFIGURATION_ACTIVE         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->C0CONFIGURATION  ,17)))
#define TSB_DMAC_C1CONFIGURATION_ACTIVE         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAC->C1CONFIGURATION  ,17)))

/* Static Memory Controller */
#define TSB_SMC_OPMODE0_0_ADV                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SMC->OPMODE0_0,11)))
#define TSB_SMC_OPMODE0_1_ADV                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SMC->OPMODE0_1,11)))
#define TSB_SMC_OPMODE0_2_ADV                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SMC->OPMODE0_2,11)))
#define TSB_SMC_OPMODE0_3_ADV                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_SMC->OPMODE0_3,11)))

/* CAN Controller (TXCAN) Mailbox RAM */
#define TSB_CANMB0_ID_RFH                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB0->ID    ,29)))
#define TSB_CANMB0_ID_GAME                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB0->ID    ,30)))
#define TSB_CANMB0_ID_IDE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB0->ID    ,31)))
#define TSB_CANMB0_TSVMCF_RTR                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB0->TSVMCF,4)))

