MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM364F10FG/mcu.h
#define TSB_CANMB1_ID_RFH                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB1->ID    ,29)))
#define TSB_CANMB1_ID_GAME                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB1->ID    ,30)))
#define TSB_CANMB1_ID_IDE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB1->ID    ,31)))
#define TSB_CANMB1_TSVMCF_RTR                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB1->TSVMCF,4)))

#define TSB_CANMB2_ID_RFH                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB2->ID    ,29)))
#define TSB_CANMB2_ID_GAME                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB2->ID    ,30)))
#define TSB_CANMB2_ID_IDE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB2->ID    ,31)))
#define TSB_CANMB2_TSVMCF_RTR                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB2->TSVMCF,4)))

#define TSB_CANMB3_ID_RFH                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB3->ID    ,29)))
#define TSB_CANMB3_ID_GAME                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB3->ID    ,30)))
#define TSB_CANMB3_ID_IDE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB3->ID    ,31)))
#define TSB_CANMB3_TSVMCF_RTR                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB3->TSVMCF,4)))

#define TSB_CANMB4_ID_RFH                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB4->ID    ,29)))
#define TSB_CANMB4_ID_GAME                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB4->ID    ,30)))
#define TSB_CANMB4_ID_IDE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB4->ID    ,31)))
#define TSB_CANMB4_TSVMCF_RTR                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB4->TSVMCF,4)))

#define TSB_CANMB5_ID_RFH                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB5->ID    ,29)))
#define TSB_CANMB5_ID_GAME                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB5->ID    ,30)))
#define TSB_CANMB5_ID_IDE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB5->ID    ,31)))
#define TSB_CANMB5_TSVMCF_RTR                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB5->TSVMCF,4)))

#define TSB_CANMB6_ID_RFH                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB6->ID    ,29)))
#define TSB_CANMB6_ID_GAME                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB6->ID    ,30)))
#define TSB_CANMB6_ID_IDE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB6->ID    ,31)))
#define TSB_CANMB6_TSVMCF_RTR                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB6->TSVMCF,4)))

#define TSB_CANMB7_ID_RFH                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB7->ID    ,29)))
#define TSB_CANMB7_ID_GAME                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB7->ID    ,30)))
#define TSB_CANMB7_ID_IDE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB7->ID    ,31)))
#define TSB_CANMB7_TSVMCF_RTR                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB7->TSVMCF,4)))

#define TSB_CANMB8_ID_RFH                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB8->ID    ,29)))
#define TSB_CANMB8_ID_GAME                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB8->ID    ,30)))
#define TSB_CANMB8_ID_IDE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB8->ID    ,31)))
#define TSB_CANMB8_TSVMCF_RTR                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB8->TSVMCF,4)))

#define TSB_CANMB9_ID_RFH                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB9->ID    ,29)))
#define TSB_CANMB9_ID_GAME                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB9->ID    ,30)))
#define TSB_CANMB9_ID_IDE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB9->ID    ,31)))
#define TSB_CANMB9_TSVMCF_RTR                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB9->TSVMCF,4)))

#define TSB_CANMB10_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB10->ID    ,29)))
#define TSB_CANMB10_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB10->ID    ,30)))
#define TSB_CANMB10_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB10->ID    ,31)))
#define TSB_CANMB10_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB10->TSVMCF,4)))

#define TSB_CANMB11_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB11->ID    ,29)))
#define TSB_CANMB11_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB11->ID    ,30)))
#define TSB_CANMB11_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB11->ID    ,31)))
#define TSB_CANMB11_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB11->TSVMCF,4)))
 
#define TSB_CANMB12_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB12->ID    ,29)))
#define TSB_CANMB12_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB12->ID    ,30)))
#define TSB_CANMB12_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB12->ID    ,31)))
#define TSB_CANMB12_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB12->TSVMCF,4)))

#define TSB_CANMB13_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB13->ID    ,29)))
#define TSB_CANMB13_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB13->ID    ,30)))
#define TSB_CANMB13_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB13->ID    ,31)))
#define TSB_CANMB13_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB13->TSVMCF,4)))

#define TSB_CANMB14_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB14->ID    ,29)))
#define TSB_CANMB14_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB14->ID    ,30)))
#define TSB_CANMB14_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB14->ID    ,31)))
#define TSB_CANMB14_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB14->TSVMCF,4)))

#define TSB_CANMB15_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB15->ID    ,29)))
#define TSB_CANMB15_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB15->ID    ,30)))
#define TSB_CANMB15_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB15->ID    ,31)))
#define TSB_CANMB15_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB15->TSVMCF,4)))

