MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM364F10FG/mcu.h
#define TSB_CANMB16_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB16->ID    ,29)))
#define TSB_CANMB16_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB16->ID    ,30)))
#define TSB_CANMB16_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB16->ID    ,31)))
#define TSB_CANMB16_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB16->TSVMCF,4)))

#define TSB_CANMB17_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB17->ID    ,29)))
#define TSB_CANMB17_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB17->ID    ,30)))
#define TSB_CANMB17_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB17->ID    ,31)))
#define TSB_CANMB17_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB17->TSVMCF,4)))

#define TSB_CANMB18_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB18->ID    ,29)))
#define TSB_CANMB18_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB18->ID    ,30)))
#define TSB_CANMB18_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB18->ID    ,31)))
#define TSB_CANMB18_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB18->TSVMCF,4)))

#define TSB_CANMB19_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB19->ID    ,29)))
#define TSB_CANMB19_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB19->ID    ,30)))
#define TSB_CANMB19_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB19->ID    ,31)))
#define TSB_CANMB19_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB19->TSVMCF,4)))

#define TSB_CANMB20_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB20->ID    ,29)))
#define TSB_CANMB20_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB20->ID    ,30)))
#define TSB_CANMB20_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB20->ID    ,31)))
#define TSB_CANMB20_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB20->TSVMCF,4)))

#define TSB_CANMB21_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB21->ID    ,29)))
#define TSB_CANMB21_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB21->ID    ,30)))
#define TSB_CANMB21_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB21->ID    ,31)))
#define TSB_CANMB21_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB21->TSVMCF,4)))

#define TSB_CANMB22_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB22->ID    ,29)))
#define TSB_CANMB22_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB22->ID    ,30)))
#define TSB_CANMB22_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB22->ID    ,31)))
#define TSB_CANMB22_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB22->TSVMCF,4)))

#define TSB_CANMB23_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB23->ID    ,29)))
#define TSB_CANMB23_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB23->ID    ,30)))
#define TSB_CANMB23_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB23->ID    ,31)))
#define TSB_CANMB23_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB23->TSVMCF,4)))

#define TSB_CANMB24_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB24->ID    ,29)))
#define TSB_CANMB24_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB24->ID    ,30)))
#define TSB_CANMB24_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB24->ID    ,31)))
#define TSB_CANMB24_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB24->TSVMCF,4)))

#define TSB_CANMB25_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB25->ID    ,29)))
#define TSB_CANMB25_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB25->ID    ,30)))
#define TSB_CANMB25_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB25->ID    ,31)))
#define TSB_CANMB25_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB25->TSVMCF,4)))

#define TSB_CANMB26_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB26->ID    ,29)))
#define TSB_CANMB26_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB26->ID    ,30)))
#define TSB_CANMB26_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB26->ID    ,31)))
#define TSB_CANMB26_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB26->TSVMCF,4)))

#define TSB_CANMB27_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB27->ID    ,29)))
#define TSB_CANMB27_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB27->ID    ,30)))
#define TSB_CANMB27_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB27->ID    ,31)))
#define TSB_CANMB27_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB27->TSVMCF,4)))

#define TSB_CANMB28_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB28->ID    ,29)))
#define TSB_CANMB28_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB28->ID    ,30)))
#define TSB_CANMB28_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB28->ID    ,31)))
#define TSB_CANMB28_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB28->TSVMCF,4)))

#define TSB_CANMB29_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB29->ID    ,29)))
#define TSB_CANMB29_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB29->ID    ,30)))
#define TSB_CANMB29_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB29->ID    ,31)))
#define TSB_CANMB29_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB29->TSVMCF,4)))

#define TSB_CANMB30_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB30->ID    ,29)))
#define TSB_CANMB30_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB30->ID    ,30)))
#define TSB_CANMB30_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB30->ID    ,31)))
#define TSB_CANMB30_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB30->TSVMCF,4)))

#define TSB_CANMB31_ID_RFH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB31->ID    ,29)))
#define TSB_CANMB31_ID_GAME                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB31->ID    ,30)))
#define TSB_CANMB31_ID_IDE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB31->ID    ,31)))
#define TSB_CANMB31_TSVMCF_RTR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANMB31->TSVMCF,4)))

