MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM364F10FG/mcu.h
/* CAN Controller (TXCAN) */
#define TSB_CAN_MC_MC0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,0)))
#define TSB_CAN_MC_MC1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,1)))
#define TSB_CAN_MC_MC2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,2)))
#define TSB_CAN_MC_MC3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,3)))
#define TSB_CAN_MC_MC4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,4)))
#define TSB_CAN_MC_MC5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,5)))
#define TSB_CAN_MC_MC6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,6)))
#define TSB_CAN_MC_MC7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,7)))
#define TSB_CAN_MC_MC8                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,8)))
#define TSB_CAN_MC_MC9                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,9)))
#define TSB_CAN_MC_MC10                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,10)))
#define TSB_CAN_MC_MC11                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,11)))
#define TSB_CAN_MC_MC12                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,12)))
#define TSB_CAN_MC_MC13                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,13)))
#define TSB_CAN_MC_MC14                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,14)))
#define TSB_CAN_MC_MC15                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,15)))
#define TSB_CAN_MC_MC16                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,16)))
#define TSB_CAN_MC_MC17                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,17)))
#define TSB_CAN_MC_MC18                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,18)))
#define TSB_CAN_MC_MC19                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,19)))
#define TSB_CAN_MC_MC20                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,20)))
#define TSB_CAN_MC_MC21                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,21)))
#define TSB_CAN_MC_MC22                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,22)))
#define TSB_CAN_MC_MC23                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,23)))
#define TSB_CAN_MC_MC24                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,24)))
#define TSB_CAN_MC_MC25                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,25)))
#define TSB_CAN_MC_MC26                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,26)))
#define TSB_CAN_MC_MC27                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,27)))
#define TSB_CAN_MC_MC28                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,28)))
#define TSB_CAN_MC_MC29                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,29)))
#define TSB_CAN_MC_MC30                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,30)))
#define TSB_CAN_MC_MC31                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MC   ,31)))
#define TSB_CAN_MD_MD0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,0)))
#define TSB_CAN_MD_MD1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,1)))
#define TSB_CAN_MD_MD2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,2)))
#define TSB_CAN_MD_MD3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,3)))
#define TSB_CAN_MD_MD4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,4)))
#define TSB_CAN_MD_MD5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,5)))
#define TSB_CAN_MD_MD6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,6)))
#define TSB_CAN_MD_MD7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,7)))
#define TSB_CAN_MD_MD8                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,8)))
#define TSB_CAN_MD_MD9                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,9)))
#define TSB_CAN_MD_MD10                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,10)))
#define TSB_CAN_MD_MD11                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,11)))
#define TSB_CAN_MD_MD12                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,12)))
#define TSB_CAN_MD_MD13                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,13)))
#define TSB_CAN_MD_MD14                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,14)))
#define TSB_CAN_MD_MD15                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,15)))
#define TSB_CAN_MD_MD16                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,16)))
#define TSB_CAN_MD_MD17                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,17)))
#define TSB_CAN_MD_MD18                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,18)))
#define TSB_CAN_MD_MD19                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,19)))
#define TSB_CAN_MD_MD20                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,20)))
#define TSB_CAN_MD_MD21                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,21)))
#define TSB_CAN_MD_MD22                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,22)))
#define TSB_CAN_MD_MD23                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,23)))
#define TSB_CAN_MD_MD24                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,24)))
#define TSB_CAN_MD_MD25                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,25)))
#define TSB_CAN_MD_MD26                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,26)))
#define TSB_CAN_MD_MD27                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,27)))
#define TSB_CAN_MD_MD28                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,28)))
#define TSB_CAN_MD_MD29                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,29)))
#define TSB_CAN_MD_MD30                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,30)))
#define TSB_CAN_MD_MD31                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->MD   ,31)))
#define TSB_CAN_LAM_LAMI                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->LAM  ,31)))
#define TSB_CAN_GAM_GAMI                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GAM  ,31)))
#define TSB_CAN_MCR_SRES                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR  ,0)))
#define TSB_CAN_MCR_TSCC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR  ,1)))
#define TSB_CAN_MCR_MTOS                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR  ,3)))
#define TSB_CAN_MCR_WUBA                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR  ,4)))
#define TSB_CAN_MCR_TSBTEST                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR  ,5)))
#define TSB_CAN_MCR_SMR                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR  ,6)))
#define TSB_CAN_MCR_CCR                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR  ,7)))
#define TSB_CAN_MCR_TSTERR                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR  ,8)))
#define TSB_CAN_MCR_TSTLB                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR  ,9)))
#define TSB_CAN_MCR_INTLB                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR  ,10)))
#define TSB_CAN_MCR_SUR                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR  ,11)))
#define TSB_CAN_GSR_EW                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR  ,0)))
#define TSB_CAN_GSR_EP                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR  ,1)))
#define TSB_CAN_GSR_BO                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR  ,2)))
#define TSB_CAN_GSR_TSO                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR  ,3)))
#define TSB_CAN_GSR_SMA                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR  ,6)))
#define TSB_CAN_GSR_CCE                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR  ,7)))
#define TSB_CAN_GSR_SUA                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR  ,8)))
#define TSB_CAN_GSR_TM                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR  ,10)))
#define TSB_CAN_GSR_RM                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR  ,11)))
#define TSB_CAN_BCR2_SAM                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->BCR2 ,7)))
#define TSB_CAN_GIM_WLIM                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIM  ,0)))
#define TSB_CAN_GIM_EPIM                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIM  ,1)))
#define TSB_CAN_GIM_BOIM                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIM  ,2)))
#define TSB_CAN_GIM_TSOIM                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIM  ,3)))
#define TSB_CAN_GIM_TRMABF                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIM  ,4)))
#define TSB_CAN_GIM_RMLIM                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIM  ,5)))
#define TSB_CAN_GIM_WUIM                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIM  ,6)))
#define TSB_CAN_GIM_RFPM                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIM  ,7)))
#define TSB_CAN_MBTIF_MBTIF0                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,0)))
#define TSB_CAN_MBTIF_MBTIF1                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,1)))
#define TSB_CAN_MBTIF_MBTIF2                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,2)))
#define TSB_CAN_MBTIF_MBTIF3                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,3)))
#define TSB_CAN_MBTIF_MBTIF4                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,4)))
#define TSB_CAN_MBTIF_MBTIF5                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,5)))
#define TSB_CAN_MBTIF_MBTIF6                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,6)))
#define TSB_CAN_MBTIF_MBTIF7                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,7)))
#define TSB_CAN_MBTIF_MBTIF8                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,8)))
#define TSB_CAN_MBTIF_MBTIF9                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,9)))
#define TSB_CAN_MBTIF_MBTIF10               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,10)))
#define TSB_CAN_MBTIF_MBTIF11               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,11)))
#define TSB_CAN_MBTIF_MBTIF12               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,12)))
#define TSB_CAN_MBTIF_MBTIF13               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,13)))
#define TSB_CAN_MBTIF_MBTIF14               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,14)))
#define TSB_CAN_MBTIF_MBTIF15               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,15)))
#define TSB_CAN_MBTIF_MBTIF16               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,16)))
#define TSB_CAN_MBTIF_MBTIF17               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,17)))
#define TSB_CAN_MBTIF_MBTIF18               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,18)))
#define TSB_CAN_MBTIF_MBTIF19               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,19)))
#define TSB_CAN_MBTIF_MBTIF20               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,20)))
#define TSB_CAN_MBTIF_MBTIF21               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,21)))
#define TSB_CAN_MBTIF_MBTIF22               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,22)))
#define TSB_CAN_MBTIF_MBTIF23               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,23)))
#define TSB_CAN_MBTIF_MBTIF24               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,24)))
#define TSB_CAN_MBTIF_MBTIF25               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,25)))
#define TSB_CAN_MBTIF_MBTIF26               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,26)))
#define TSB_CAN_MBTIF_MBTIF27               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,27)))
#define TSB_CAN_MBTIF_MBTIF28               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,28)))
#define TSB_CAN_MBTIF_MBTIF29               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,29)))
#define TSB_CAN_MBTIF_MBTIF30               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,30)))
#define TSB_CAN_MBRIF_MBRIF0                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,0)))
#define TSB_CAN_MBRIF_MBRIF1                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,1)))
#define TSB_CAN_MBRIF_MBRIF2                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,2)))
#define TSB_CAN_MBRIF_MBRIF3                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,3)))
#define TSB_CAN_MBRIF_MBRIF4                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,4)))
#define TSB_CAN_MBRIF_MBRIF5                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,5)))
#define TSB_CAN_MBRIF_MBRIF6                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,6)))
#define TSB_CAN_MBRIF_MBRIF7                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,7)))
#define TSB_CAN_MBRIF_MBRIF8                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,8)))
#define TSB_CAN_MBRIF_MBRIF9                (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,9)))
#define TSB_CAN_MBRIF_MBRIF10               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,10)))
#define TSB_CAN_MBRIF_MBRIF11               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,11)))
#define TSB_CAN_MBRIF_MBRIF12               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,12)))
#define TSB_CAN_MBRIF_MBRIF13               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,13)))
#define TSB_CAN_MBRIF_MBRIF14               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,14)))
#define TSB_CAN_MBRIF_MBRIF15               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,15)))
#define TSB_CAN_MBRIF_MBRIF16               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,16)))
#define TSB_CAN_MBRIF_MBRIF17               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,17)))
#define TSB_CAN_MBRIF_MBRIF18               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,18)))
#define TSB_CAN_MBRIF_MBRIF19               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,19)))
#define TSB_CAN_MBRIF_MBRIF20               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,20)))
#define TSB_CAN_MBRIF_MBRIF21               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,21)))
#define TSB_CAN_MBRIF_MBRIF22               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,22)))
#define TSB_CAN_MBRIF_MBRIF23               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,23)))
#define TSB_CAN_MBRIF_MBRIF24               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,24)))
#define TSB_CAN_MBRIF_MBRIF25               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,25)))
#define TSB_CAN_MBRIF_MBRIF26               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,26)))
#define TSB_CAN_MBRIF_MBRIF27               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,27)))
#define TSB_CAN_MBRIF_MBRIF28               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,28)))
#define TSB_CAN_MBRIF_MBRIF29               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,29)))
#define TSB_CAN_MBRIF_MBRIF30               (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,30)))
#define TSB_CAN_MBIM_MBIM0                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,0)))
#define TSB_CAN_MBIM_MBIM1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,1)))
#define TSB_CAN_MBIM_MBIM2                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,2)))
#define TSB_CAN_MBIM_MBIM3                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,3)))
#define TSB_CAN_MBIM_MBIM4                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,4)))
#define TSB_CAN_MBIM_MBIM5                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,5)))
#define TSB_CAN_MBIM_MBIM6                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,6)))
#define TSB_CAN_MBIM_MBIM7                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,7)))
#define TSB_CAN_MBIM_MBIM8                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,8)))
#define TSB_CAN_MBIM_MBIM9                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,9)))
#define TSB_CAN_MBIM_MBIM10                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,10)))
#define TSB_CAN_MBIM_MBIM11                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,11)))
#define TSB_CAN_MBIM_MBIM12                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,12)))
#define TSB_CAN_MBIM_MBIM13                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,13)))
#define TSB_CAN_MBIM_MBIM14                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,14)))
#define TSB_CAN_MBIM_MBIM15                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,15)))
#define TSB_CAN_MBIM_MBIM16                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,16)))
#define TSB_CAN_MBIM_MBIM17                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,17)))
#define TSB_CAN_MBIM_MBIM18                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,18)))
#define TSB_CAN_MBIM_MBIM19                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,19)))
#define TSB_CAN_MBIM_MBIM20                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,20)))
#define TSB_CAN_MBIM_MBIM21                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,21)))
#define TSB_CAN_MBIM_MBIM22                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,22)))
#define TSB_CAN_MBIM_MBIM23                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,23)))
#define TSB_CAN_MBIM_MBIM24                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,24)))
#define TSB_CAN_MBIM_MBIM25                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,25)))
#define TSB_CAN_MBIM_MBIM26                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,26)))
#define TSB_CAN_MBIM_MBIM27                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,27)))
#define TSB_CAN_MBIM_MBIM28                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,28)))
#define TSB_CAN_MBIM_MBIM29                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,29)))
#define TSB_CAN_MBIM_MBIM30                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,30)))
#define TSB_CAN_MBIM_MBIM31                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM ,31)))
#define TSB_CAN_CDR_CDR0                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,0)))
#define TSB_CAN_CDR_CDR1                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,1)))
#define TSB_CAN_CDR_CDR2                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,2)))
#define TSB_CAN_CDR_CDR3                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,3)))
#define TSB_CAN_CDR_CDR4                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,4)))
#define TSB_CAN_CDR_CDR5                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,5)))
#define TSB_CAN_CDR_CDR6                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,6)))
#define TSB_CAN_CDR_CDR7                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,7)))
#define TSB_CAN_CDR_CDR8                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,8)))
#define TSB_CAN_CDR_CDR9                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,9)))
#define TSB_CAN_CDR_CDR10                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,10)))
#define TSB_CAN_CDR_CDR11                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,11)))
#define TSB_CAN_CDR_CDR12                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,12)))
#define TSB_CAN_CDR_CDR13                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,13)))
#define TSB_CAN_CDR_CDR14                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,14)))
#define TSB_CAN_CDR_CDR15                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,15)))
#define TSB_CAN_CDR_CDR16                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,16)))
#define TSB_CAN_CDR_CDR17                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,17)))
#define TSB_CAN_CDR_CDR18                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,18)))
#define TSB_CAN_CDR_CDR19                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,19)))
#define TSB_CAN_CDR_CDR20                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,20)))
#define TSB_CAN_CDR_CDR21                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,21)))
#define TSB_CAN_CDR_CDR22                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,22)))
#define TSB_CAN_CDR_CDR23                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,23)))
#define TSB_CAN_CDR_CDR24                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,24)))
#define TSB_CAN_CDR_CDR25                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,25)))
#define TSB_CAN_CDR_CDR26                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,26)))
#define TSB_CAN_CDR_CDR27                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,27)))
#define TSB_CAN_CDR_CDR28                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,28)))
#define TSB_CAN_CDR_CDR29                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,29)))
#define TSB_CAN_CDR_CDR30                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR  ,30)))
#define TSB_CAN_RFP_RFP0                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,0)))
#define TSB_CAN_RFP_RFP1                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,1)))
#define TSB_CAN_RFP_RFP2                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,2)))
#define TSB_CAN_RFP_RFP3                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,3)))
#define TSB_CAN_RFP_RFP4                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,4)))
#define TSB_CAN_RFP_RFP5                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,5)))
#define TSB_CAN_RFP_RFP6                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,6)))
#define TSB_CAN_RFP_RFP7                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,7)))
#define TSB_CAN_RFP_RFP8                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,8)))
#define TSB_CAN_RFP_RFP9                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,9)))
#define TSB_CAN_RFP_RFP10                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,10)))
#define TSB_CAN_RFP_RFP11                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,11)))
#define TSB_CAN_RFP_RFP12                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,12)))
#define TSB_CAN_RFP_RFP13                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,13)))
#define TSB_CAN_RFP_RFP14                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,14)))
#define TSB_CAN_RFP_RFP15                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,15)))
#define TSB_CAN_RFP_RFP16                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,16)))
#define TSB_CAN_RFP_RFP17                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,17)))
#define TSB_CAN_RFP_RFP18                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,18)))
#define TSB_CAN_RFP_RFP19                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,19)))
#define TSB_CAN_RFP_RFP20                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,20)))
#define TSB_CAN_RFP_RFP21                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,21)))
#define TSB_CAN_RFP_RFP22                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RFP  ,22)))
