MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM364F10FG/mcu.h
/* General Purpose Input/Output Port (PH) */
#define TSB_PH_DATA_PH0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->DATA,0)))
#define TSB_PH_DATA_PH1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->DATA,1)))
#define TSB_PH_DATA_PH2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->DATA,2)))
#define TSB_PH_DATA_PH3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->DATA,3)))
#define TSB_PH_DATA_PH4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->DATA,4)))
#define TSB_PH_DATA_PH5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->DATA,5)))
#define TSB_PH_DATA_PH6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->DATA,6)))
#define TSB_PH_DATA_PH7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->DATA,7)))
#define TSB_PH_CR_PH0C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->CR  ,0)))
#define TSB_PH_CR_PH1C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->CR  ,1)))
#define TSB_PH_CR_PH2C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->CR  ,2)))
#define TSB_PH_CR_PH3C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->CR  ,3)))
#define TSB_PH_CR_PH4C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->CR  ,4)))
#define TSB_PH_CR_PH5C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->CR  ,5)))
#define TSB_PH_CR_PH6C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->CR  ,6)))
#define TSB_PH_CR_PH7C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->CR  ,7)))
#define TSB_PH_FR1_PH0F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->FR1 ,0)))
#define TSB_PH_FR1_PH1F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->FR1 ,1)))
#define TSB_PH_FR1_PH2F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->FR1 ,2)))
#define TSB_PH_FR1_PH3F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->FR1 ,3)))
#define TSB_PH_FR1_PH4F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->FR1 ,4)))
#define TSB_PH_FR1_PH5F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->FR1 ,5)))
#define TSB_PH_FR1_PH6F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->FR1 ,6)))
#define TSB_PH_FR1_PH7F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->FR1 ,7)))
#define TSB_PH_FR2_PH0F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->FR2 ,0)))
#define TSB_PH_FR2_PH1F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->FR2 ,1)))
#define TSB_PH_FR2_PH2F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->FR2 ,2)))
#define TSB_PH_FR2_PH3F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->FR2 ,3)))
#define TSB_PH_FR2_PH4F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->FR2 ,4)))
#define TSB_PH_FR2_PH5F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->FR2 ,5)))
#define TSB_PH_FR2_PH6F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->FR2 ,6)))
#define TSB_PH_FR2_PH7F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->FR2 ,7)))
#define TSB_PH_OD_PH0OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->OD  ,0)))
#define TSB_PH_OD_PH1OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->OD  ,1)))
#define TSB_PH_OD_PH2OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->OD  ,2)))
#define TSB_PH_OD_PH3OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->OD  ,3)))
#define TSB_PH_OD_PH4OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->OD  ,4)))
#define TSB_PH_OD_PH5OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->OD  ,5)))
#define TSB_PH_OD_PH6OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->OD  ,6)))
#define TSB_PH_OD_PH7OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->OD  ,7)))
#define TSB_PH_PUP_PH0UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->PUP ,0)))
#define TSB_PH_PUP_PH1UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->PUP ,1)))
#define TSB_PH_PUP_PH2UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->PUP ,2)))
#define TSB_PH_PUP_PH3UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->PUP ,3)))
#define TSB_PH_PUP_PH4UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->PUP ,4)))
#define TSB_PH_PUP_PH5UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->PUP ,5)))
#define TSB_PH_PUP_PH6UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->PUP ,6)))
#define TSB_PH_PUP_PH7UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->PUP ,7)))
#define TSB_PH_IE_PH0IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->IE  ,0)))
#define TSB_PH_IE_PH1IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->IE  ,1)))
#define TSB_PH_IE_PH2IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->IE  ,2)))
#define TSB_PH_IE_PH3IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->IE  ,3)))
#define TSB_PH_IE_PH4IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->IE  ,4)))
#define TSB_PH_IE_PH5IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->IE  ,5)))
#define TSB_PH_IE_PH6IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->IE  ,6)))
#define TSB_PH_IE_PH7IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PH->IE  ,7)))

/* General Purpose Input/Output Port (PI) */
#define TSB_PI_DATA_PI0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PI->DATA,0)))
#define TSB_PI_DATA_PI1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PI->DATA,1)))
#define TSB_PI_CR_PI0C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PI->CR  ,0)))
#define TSB_PI_CR_PI1C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PI->CR  ,1)))
#define TSB_PI_FR1_PI0F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PI->FR1 ,0)))
#define TSB_PI_FR1_PI1F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PI->FR1 ,1)))
#define TSB_PI_OD_PI0OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PI->OD  ,0)))
#define TSB_PI_PUP_PI0UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PI->PUP ,0)))
#define TSB_PI_IE_PI0IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PI->IE  ,0)))
#define TSB_PI_IE_PI1IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PI->IE  ,1)))

