MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM364F10FG/mcu.h
/* General Purpose Input/Output Port (PO) */
#define TSB_PO_DATA_PO0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->DATA,0)))
#define TSB_PO_DATA_PO1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->DATA,1)))
#define TSB_PO_DATA_PO2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->DATA,2)))
#define TSB_PO_DATA_PO3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->DATA,3)))
#define TSB_PO_DATA_PO4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->DATA,4)))
#define TSB_PO_DATA_PO5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->DATA,5)))
#define TSB_PO_DATA_PO6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->DATA,6)))
#define TSB_PO_DATA_PO7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->DATA,7)))
#define TSB_PO_CR_PO0C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->CR  ,0)))
#define TSB_PO_CR_PO1C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->CR  ,1)))
#define TSB_PO_CR_PO2C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->CR  ,2)))
#define TSB_PO_CR_PO3C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->CR  ,3)))
#define TSB_PO_CR_PO4C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->CR  ,4)))
#define TSB_PO_CR_PO5C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->CR  ,5)))
#define TSB_PO_CR_PO6C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->CR  ,6)))
#define TSB_PO_CR_PO7C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->CR  ,7)))
#define TSB_PO_FR1_PO0F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->FR1 ,0)))
#define TSB_PO_FR1_PO1F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->FR1 ,1)))
#define TSB_PO_FR1_PO2F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->FR1 ,2)))
#define TSB_PO_FR1_PO3F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->FR1 ,3)))
#define TSB_PO_FR1_PO4F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->FR1 ,4)))
#define TSB_PO_FR1_PO5F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->FR1 ,5)))
#define TSB_PO_FR1_PO6F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->FR1 ,6)))
#define TSB_PO_FR2_PO0F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->FR2 ,0)))
#define TSB_PO_FR2_PO1F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->FR2 ,1)))
#define TSB_PO_FR2_PO2F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->FR2 ,2)))
#define TSB_PO_FR2_PO3F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->FR2 ,3)))
#define TSB_PO_FR2_PO4F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->FR2 ,4)))
#define TSB_PO_FR2_PO5F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->FR2 ,5)))
#define TSB_PO_FR2_PO6F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->FR2 ,6)))
#define TSB_PO_FR3_PO2F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->FR3 ,2)))
#define TSB_PO_FR3_PO6F3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->FR3 ,6)))
#define TSB_PO_OD_PO0OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->OD  ,0)))
#define TSB_PO_OD_PO1OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->OD  ,1)))
#define TSB_PO_OD_PO2OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->OD  ,2)))
#define TSB_PO_OD_PO3OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->OD  ,3)))
#define TSB_PO_OD_PO4OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->OD  ,4)))
#define TSB_PO_OD_PO5OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->OD  ,5)))
#define TSB_PO_OD_PO6OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->OD  ,6)))
#define TSB_PO_OD_PO7OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->OD  ,7)))
#define TSB_PO_PUP_PO0UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->PUP ,0)))
#define TSB_PO_PUP_PO1UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->PUP ,1)))
#define TSB_PO_PUP_PO2UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->PUP ,2)))
#define TSB_PO_PUP_PO3UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->PUP ,3)))
#define TSB_PO_PUP_PO4UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->PUP ,4)))
#define TSB_PO_PUP_PO5UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->PUP ,5)))
#define TSB_PO_PUP_PO6UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->PUP ,6)))
#define TSB_PO_PUP_PO7UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->PUP ,7)))
#define TSB_PO_IE_PO0IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->IE  ,0)))
#define TSB_PO_IE_PO1IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->IE  ,1)))
#define TSB_PO_IE_PO2IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->IE  ,2)))
#define TSB_PO_IE_PO3IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->IE  ,3)))
#define TSB_PO_IE_PO4IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->IE  ,4)))
#define TSB_PO_IE_PO5IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->IE  ,5)))
#define TSB_PO_IE_PO6IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->IE  ,6)))
#define TSB_PO_IE_PO7IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PO->IE  ,7)))

/* General Purpose Input/Output Port (PP) */
#define TSB_PP_DATA_PP0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->DATA,0)))
#define TSB_PP_DATA_PP1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->DATA,1)))
#define TSB_PP_DATA_PP2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->DATA,2)))
#define TSB_PP_DATA_PP3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->DATA,3)))
#define TSB_PP_DATA_PP4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->DATA,4)))
#define TSB_PP_DATA_PP5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->DATA,5)))
#define TSB_PP_DATA_PP6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->DATA,6)))
#define TSB_PP_CR_PP0C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->CR  ,0)))
#define TSB_PP_CR_PP1C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->CR  ,1)))
#define TSB_PP_CR_PP2C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->CR  ,2)))
#define TSB_PP_CR_PP3C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->CR  ,3)))
#define TSB_PP_CR_PP4C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->CR  ,4)))
#define TSB_PP_CR_PP5C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->CR  ,5)))
#define TSB_PP_CR_PP6C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->CR  ,6)))
#define TSB_PP_FR1_PP0F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->FR1 ,0)))
#define TSB_PP_FR1_PP1F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->FR1 ,1)))
#define TSB_PP_FR1_PP2F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->FR1 ,2)))
#define TSB_PP_FR1_PP3F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->FR1 ,3)))
#define TSB_PP_FR1_PP4F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->FR1 ,4)))
#define TSB_PP_FR1_PP5F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->FR1 ,5)))
#define TSB_PP_FR1_PP6F1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->FR1 ,6)))
#define TSB_PP_FR2_PP2F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->FR2 ,2)))
#define TSB_PP_FR2_PP3F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->FR2 ,3)))
#define TSB_PP_FR2_PP4F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->FR2 ,4)))
#define TSB_PP_FR2_PP5F2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->FR2 ,5)))
#define TSB_PP_OD_PP0OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->OD  ,0)))
#define TSB_PP_OD_PP1OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->OD  ,1)))
#define TSB_PP_OD_PP2OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->OD  ,2)))
#define TSB_PP_OD_PP3OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->OD  ,3)))
#define TSB_PP_OD_PP4OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->OD  ,4)))
#define TSB_PP_OD_PP5OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->OD  ,5)))
#define TSB_PP_OD_PP6OD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->OD  ,6)))
#define TSB_PP_PUP_PP0UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->PUP ,0)))
#define TSB_PP_PUP_PP1UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->PUP ,1)))
#define TSB_PP_PUP_PP2UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->PUP ,2)))
#define TSB_PP_PUP_PP3UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->PUP ,3)))
#define TSB_PP_PUP_PP4UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->PUP ,4)))
#define TSB_PP_PUP_PP5UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->PUP ,5)))
#define TSB_PP_PUP_PP6UP                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->PUP ,6)))
#define TSB_PP_IE_PP0IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->IE  ,0)))
#define TSB_PP_IE_PP1IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->IE  ,1)))
#define TSB_PP_IE_PP2IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->IE  ,2)))
#define TSB_PP_IE_PP3IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->IE  ,3)))
#define TSB_PP_IE_PP4IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->IE  ,4)))
#define TSB_PP_IE_PP5IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->IE  ,5)))
#define TSB_PP_IE_PP6IE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PP->IE  ,6)))

/* 16-bit Timer/Event Counter (TB) */
#define TSB_TB0_EN_TBEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB0->EN  ,7)))
#define TSB_TB0_RUN_TBRUN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB0->RUN ,0)))
#define TSB_TB0_RUN_TBPRUN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB0->RUN ,2)))
#define TSB_TB0_CR_I2TB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB0->CR  ,3)))
#define TSB_TB0_CR_TBSYNC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB0->CR  ,5)))
#define TSB_TB0_CR_TBWBF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB0->CR  ,7)))
#define TSB_TB0_MOD_TBCLE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB0->MOD ,2)))
#define TSB_TB0_MOD_TBCP                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_TB0->MOD ,5)))
#define TSB_TB0_FFCR_TBE0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB0->FFCR,2)))
#define TSB_TB0_FFCR_TBE1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB0->FFCR,3)))
#define TSB_TB0_FFCR_TBC0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB0->FFCR,4)))
#define TSB_TB0_FFCR_TBC1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB0->FFCR,5)))
#define TSB_TB0_IM_TBIM0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB0->IM  ,0)))
#define TSB_TB0_IM_TBIM1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB0->IM  ,1)))
#define TSB_TB0_IM_TBIMOF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB0->IM  ,2)))

