MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM364F10FG/mcu.h
#define TSB_TB1_EN_TBEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB1->EN  ,7)))
#define TSB_TB1_RUN_TBRUN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB1->RUN ,0)))
#define TSB_TB1_RUN_TBPRUN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB1->RUN ,2)))
#define TSB_TB1_CR_I2TB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB1->CR  ,3)))
#define TSB_TB1_CR_TBSYNC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB1->CR  ,5)))
#define TSB_TB1_CR_TBWBF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB1->CR  ,7)))
#define TSB_TB1_MOD_TBCLE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB1->MOD ,2)))
#define TSB_TB1_MOD_TBCP                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_TB1->MOD ,5)))
#define TSB_TB1_FFCR_TBE0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB1->FFCR,2)))
#define TSB_TB1_FFCR_TBE1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB1->FFCR,3)))
#define TSB_TB1_FFCR_TBC0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB1->FFCR,4)))
#define TSB_TB1_FFCR_TBC1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB1->FFCR,5)))
#define TSB_TB1_IM_TBIM0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB1->IM  ,0)))
#define TSB_TB1_IM_TBIM1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB1->IM  ,1)))
#define TSB_TB1_IM_TBIMOF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB1->IM  ,2)))

#define TSB_TB2_EN_TBEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB2->EN  ,7)))
#define TSB_TB2_RUN_TBRUN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB2->RUN ,0)))
#define TSB_TB2_RUN_TBPRUN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB2->RUN ,2)))
#define TSB_TB2_CR_I2TB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB2->CR  ,3)))
#define TSB_TB2_CR_TBSYNC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB2->CR  ,5)))
#define TSB_TB2_CR_TBWBF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB2->CR  ,7)))
#define TSB_TB2_MOD_TBCLE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB2->MOD ,2)))
#define TSB_TB2_MOD_TBCP                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_TB2->MOD ,5)))
#define TSB_TB2_FFCR_TBE0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB2->FFCR,2)))
#define TSB_TB2_FFCR_TBE1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB2->FFCR,3)))
#define TSB_TB2_FFCR_TBC0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB2->FFCR,4)))
#define TSB_TB2_FFCR_TBC1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB2->FFCR,5)))
#define TSB_TB2_IM_TBIM0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB2->IM  ,0)))
#define TSB_TB2_IM_TBIM1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB2->IM  ,1)))
#define TSB_TB2_IM_TBIMOF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB2->IM  ,2)))

#define TSB_TB3_EN_TBEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB3->EN  ,7)))
#define TSB_TB3_RUN_TBRUN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB3->RUN ,0)))
#define TSB_TB3_RUN_TBPRUN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB3->RUN ,2)))
#define TSB_TB3_CR_I2TB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB3->CR  ,3)))
#define TSB_TB3_CR_TBSYNC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB3->CR  ,5)))
#define TSB_TB3_CR_TBWBF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB3->CR  ,7)))
#define TSB_TB3_MOD_TBCLE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB3->MOD ,2)))
#define TSB_TB3_MOD_TBCP                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_TB3->MOD ,5)))
#define TSB_TB3_FFCR_TBE0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB3->FFCR,2)))
#define TSB_TB3_FFCR_TBE1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB3->FFCR,3)))
#define TSB_TB3_FFCR_TBC0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB3->FFCR,4)))
#define TSB_TB3_FFCR_TBC1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB3->FFCR,5)))
#define TSB_TB3_IM_TBIM0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB3->IM  ,0)))
#define TSB_TB3_IM_TBIM1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB3->IM  ,1)))
#define TSB_TB3_IM_TBIMOF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB3->IM  ,2)))

#define TSB_TB4_EN_TBEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB4->EN  ,7)))
#define TSB_TB4_RUN_TBRUN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB4->RUN ,0)))
#define TSB_TB4_RUN_TBPRUN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB4->RUN ,2)))
#define TSB_TB4_CR_I2TB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB4->CR  ,3)))
#define TSB_TB4_CR_TBSYNC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB4->CR  ,5)))
#define TSB_TB4_CR_TBWBF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB4->CR  ,7)))
#define TSB_TB4_MOD_TBCLE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB4->MOD ,2)))
#define TSB_TB4_MOD_TBCP                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_TB4->MOD ,5)))
#define TSB_TB4_FFCR_TBE0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB4->FFCR,2)))
#define TSB_TB4_FFCR_TBE1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB4->FFCR,3)))
#define TSB_TB4_FFCR_TBC0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB4->FFCR,4)))
#define TSB_TB4_FFCR_TBC1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB4->FFCR,5)))
#define TSB_TB4_IM_TBIM0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB4->IM  ,0)))
#define TSB_TB4_IM_TBIM1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB4->IM  ,1)))
#define TSB_TB4_IM_TBIMOF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB4->IM  ,2)))

#define TSB_TB5_EN_TBEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB5->EN  ,7)))
#define TSB_TB5_RUN_TBRUN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB5->RUN ,0)))
#define TSB_TB5_RUN_TBPRUN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB5->RUN ,2)))
#define TSB_TB5_CR_I2TB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB5->CR  ,3)))
#define TSB_TB5_CR_TBSYNC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB5->CR  ,5)))
#define TSB_TB5_CR_TBWBF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB5->CR  ,7)))
#define TSB_TB5_MOD_TBCLE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB5->MOD ,2)))
#define TSB_TB5_MOD_TBCP                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_TB5->MOD ,5)))
#define TSB_TB5_FFCR_TBE0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB5->FFCR,2)))
#define TSB_TB5_FFCR_TBE1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB5->FFCR,3)))
#define TSB_TB5_FFCR_TBC0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB5->FFCR,4)))
#define TSB_TB5_FFCR_TBC1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB5->FFCR,5)))
#define TSB_TB5_IM_TBIM0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB5->IM  ,0)))
#define TSB_TB5_IM_TBIM1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB5->IM  ,1)))
#define TSB_TB5_IM_TBIMOF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB5->IM  ,2)))

#define TSB_TB6_EN_TBEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB6->EN  ,7)))
#define TSB_TB6_RUN_TBRUN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB6->RUN ,0)))
#define TSB_TB6_RUN_TBPRUN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB6->RUN ,2)))
#define TSB_TB6_CR_I2TB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB6->CR  ,3)))
#define TSB_TB6_CR_TBSYNC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB6->CR  ,5)))
#define TSB_TB6_CR_TBWBF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB6->CR  ,7)))
#define TSB_TB6_MOD_TBCLE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB6->MOD ,2)))
#define TSB_TB6_MOD_TBCP                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_TB6->MOD ,5)))
#define TSB_TB6_FFCR_TBE0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB6->FFCR,2)))
#define TSB_TB6_FFCR_TBE1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB6->FFCR,3)))
#define TSB_TB6_FFCR_TBC0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB6->FFCR,4)))
#define TSB_TB6_FFCR_TBC1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB6->FFCR,5)))
#define TSB_TB6_IM_TBIM0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB6->IM  ,0)))
#define TSB_TB6_IM_TBIM1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB6->IM  ,1)))
#define TSB_TB6_IM_TBIMOF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB6->IM  ,2)))

