MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM364F10FG/mcu.h
#define TSB_TB7_EN_TBEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB7->EN  ,7)))
#define TSB_TB7_RUN_TBRUN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB7->RUN ,0)))
#define TSB_TB7_RUN_TBPRUN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB7->RUN ,2)))
#define TSB_TB7_CR_I2TB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB7->CR  ,3)))
#define TSB_TB7_CR_TBSYNC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB7->CR  ,5)))
#define TSB_TB7_CR_TBWBF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB7->CR  ,7)))
#define TSB_TB7_MOD_TBCLE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB7->MOD ,2)))
#define TSB_TB7_MOD_TBCP                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_TB7->MOD ,5)))
#define TSB_TB7_FFCR_TBE0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB7->FFCR,2)))
#define TSB_TB7_FFCR_TBE1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB7->FFCR,3)))
#define TSB_TB7_FFCR_TBC0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB7->FFCR,4)))
#define TSB_TB7_FFCR_TBC1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB7->FFCR,5)))
#define TSB_TB7_IM_TBIM0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB7->IM  ,0)))
#define TSB_TB7_IM_TBIM1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB7->IM  ,1)))
#define TSB_TB7_IM_TBIMOF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB7->IM  ,2)))

#define TSB_TB8_EN_TBEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB8->EN  ,7)))
#define TSB_TB8_RUN_TBRUN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB8->RUN ,0)))
#define TSB_TB8_RUN_TBPRUN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB8->RUN ,2)))
#define TSB_TB8_CR_I2TB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB8->CR  ,3)))
#define TSB_TB8_CR_TBSYNC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB8->CR  ,5)))
#define TSB_TB8_CR_TBWBF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB8->CR  ,7)))
#define TSB_TB8_MOD_TBCLE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB8->MOD ,2)))
#define TSB_TB8_MOD_TBCP                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_TB8->MOD ,5)))
#define TSB_TB8_FFCR_TBE0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB8->FFCR,2)))
#define TSB_TB8_FFCR_TBE1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB8->FFCR,3)))
#define TSB_TB8_FFCR_TBC0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB8->FFCR,4)))
#define TSB_TB8_FFCR_TBC1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB8->FFCR,5)))
#define TSB_TB8_IM_TBIM0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB8->IM  ,0)))
#define TSB_TB8_IM_TBIM1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB8->IM  ,1)))
#define TSB_TB8_IM_TBIMOF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB8->IM  ,2)))

#define TSB_TB9_EN_TBEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB9->EN  ,7)))
#define TSB_TB9_RUN_TBRUN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB9->RUN ,0)))
#define TSB_TB9_RUN_TBPRUN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB9->RUN ,2)))
#define TSB_TB9_CR_I2TB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB9->CR  ,3)))
#define TSB_TB9_CR_TBSYNC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB9->CR  ,5)))
#define TSB_TB9_CR_TBWBF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB9->CR  ,7)))
#define TSB_TB9_MOD_TBCLE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB9->MOD ,2)))
#define TSB_TB9_MOD_TBCP                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_TB9->MOD ,5)))
#define TSB_TB9_FFCR_TBE0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB9->FFCR,2)))
#define TSB_TB9_FFCR_TBE1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB9->FFCR,3)))
#define TSB_TB9_FFCR_TBC0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB9->FFCR,4)))
#define TSB_TB9_FFCR_TBC1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB9->FFCR,5)))
#define TSB_TB9_IM_TBIM0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB9->IM  ,0)))
#define TSB_TB9_IM_TBIM1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB9->IM  ,1)))
#define TSB_TB9_IM_TBIMOF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TB9->IM  ,2)))

#define TSB_TBA_EN_TBEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBA->EN  ,7)))
#define TSB_TBA_RUN_TBRUN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBA->RUN ,0)))
#define TSB_TBA_RUN_TBPRUN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBA->RUN ,2)))
#define TSB_TBA_CR_I2TB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBA->CR  ,3)))
#define TSB_TBA_CR_TBSYNC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBA->CR  ,5)))
#define TSB_TBA_CR_TBWBF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBA->CR  ,7)))
#define TSB_TBA_MOD_TBCLE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBA->MOD ,2)))
#define TSB_TBA_MOD_TBCP                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_TBA->MOD ,5)))
#define TSB_TBA_FFCR_TBE0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBA->FFCR,2)))
#define TSB_TBA_FFCR_TBE1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBA->FFCR,3)))
#define TSB_TBA_FFCR_TBC0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBA->FFCR,4)))
#define TSB_TBA_FFCR_TBC1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBA->FFCR,5)))
#define TSB_TBA_IM_TBIM0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBA->IM  ,0)))
#define TSB_TBA_IM_TBIM1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBA->IM  ,1)))
#define TSB_TBA_IM_TBIMOF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBA->IM  ,2)))

#define TSB_TBB_EN_TBEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBB->EN  ,7)))
#define TSB_TBB_RUN_TBRUN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBB->RUN ,0)))
#define TSB_TBB_RUN_TBPRUN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBB->RUN ,2)))
#define TSB_TBB_CR_I2TB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBB->CR  ,3)))
#define TSB_TBB_CR_TBSYNC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBB->CR  ,5)))
#define TSB_TBB_CR_TBWBF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBB->CR  ,7)))
#define TSB_TBB_MOD_TBCLE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBB->MOD ,2)))
#define TSB_TBB_MOD_TBCP                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_TBB->MOD ,5)))
#define TSB_TBB_FFCR_TBE0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBB->FFCR,2)))
#define TSB_TBB_FFCR_TBE1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBB->FFCR,3)))
#define TSB_TBB_FFCR_TBC0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBB->FFCR,4)))
#define TSB_TBB_FFCR_TBC1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBB->FFCR,5)))
#define TSB_TBB_IM_TBIM0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBB->IM  ,0)))
#define TSB_TBB_IM_TBIM1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBB->IM  ,1)))
#define TSB_TBB_IM_TBIMOF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBB->IM  ,2)))

#define TSB_TBC_EN_TBEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBC->EN  ,7)))
#define TSB_TBC_RUN_TBRUN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBC->RUN ,0)))
#define TSB_TBC_RUN_TBPRUN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBC->RUN ,2)))
#define TSB_TBC_CR_I2TB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBC->CR  ,3)))
#define TSB_TBC_CR_TBSYNC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBC->CR  ,5)))
#define TSB_TBC_CR_TBWBF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBC->CR  ,7)))
#define TSB_TBC_MOD_TBCLE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBC->MOD ,2)))
#define TSB_TBC_MOD_TBCP                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_TBC->MOD ,5)))
#define TSB_TBC_FFCR_TBE0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBC->FFCR,2)))
#define TSB_TBC_FFCR_TBE1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBC->FFCR,3)))
#define TSB_TBC_FFCR_TBC0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBC->FFCR,4)))
#define TSB_TBC_FFCR_TBC1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBC->FFCR,5)))
#define TSB_TBC_IM_TBIM0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBC->IM  ,0)))
#define TSB_TBC_IM_TBIM1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBC->IM  ,1)))
#define TSB_TBC_IM_TBIMOF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBC->IM  ,2)))

#define TSB_TBD_EN_TBEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBD->EN  ,7)))
#define TSB_TBD_RUN_TBRUN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBD->RUN ,0)))
#define TSB_TBD_RUN_TBPRUN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBD->RUN ,2)))
#define TSB_TBD_CR_I2TB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBD->CR  ,3)))
#define TSB_TBD_CR_TBSYNC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBD->CR  ,5)))
#define TSB_TBD_CR_TBWBF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBD->CR  ,7)))
#define TSB_TBD_MOD_TBCLE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBD->MOD ,2)))
#define TSB_TBD_MOD_TBCP                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_TBD->MOD ,5)))
#define TSB_TBD_FFCR_TBE0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBD->FFCR,2)))
#define TSB_TBD_FFCR_TBE1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBD->FFCR,3)))
#define TSB_TBD_FFCR_TBC0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBD->FFCR,4)))
#define TSB_TBD_FFCR_TBC1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBD->FFCR,5)))
#define TSB_TBD_IM_TBIM0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBD->IM  ,0)))
#define TSB_TBD_IM_TBIM1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBD->IM  ,1)))
#define TSB_TBD_IM_TBIMOF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBD->IM  ,2)))

#define TSB_TBE_EN_TBEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBE->EN  ,7)))
#define TSB_TBE_RUN_TBRUN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBE->RUN ,0)))
#define TSB_TBE_RUN_TBPRUN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBE->RUN ,2)))
#define TSB_TBE_CR_I2TB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBE->CR  ,3)))
#define TSB_TBE_CR_TBSYNC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBE->CR  ,5)))
#define TSB_TBE_CR_TBWBF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBE->CR  ,7)))
#define TSB_TBE_MOD_TBCLE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBE->MOD ,2)))
#define TSB_TBE_MOD_TBCP                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_TBE->MOD ,5)))
#define TSB_TBE_FFCR_TBE0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBE->FFCR,2)))
#define TSB_TBE_FFCR_TBE1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBE->FFCR,3)))
#define TSB_TBE_FFCR_TBC0T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBE->FFCR,4)))
#define TSB_TBE_FFCR_TBC1T1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBE->FFCR,5)))
#define TSB_TBE_IM_TBIM0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBE->IM  ,0)))
#define TSB_TBE_IM_TBIM1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBE->IM  ,1)))
#define TSB_TBE_IM_TBIMOF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TBE->IM  ,2)))

