MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM364F10FG/mcu.h
/* Remote Control Signal Preprocessor (RMC) */
#define TSB_RMC0_EN_RMCEN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->EN   ,0)))
#define TSB_RMC0_EN_I2RMC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->EN   ,1)))
#define TSB_RMC0_REN_RMCREN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->REN  ,0)))
#define TSB_RMC0_RCR2_RMCPHM                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->RCR2 ,24)))
#define TSB_RMC0_RCR2_RMCLD                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->RCR2 ,25)))
#define TSB_RMC0_RCR2_RMCEDIEN               (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->RCR2 ,30)))
#define TSB_RMC0_RCR2_RMCLIEN                (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->RCR2 ,31)))
#define TSB_RMC0_RCR4_RMCPO                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->RCR4 ,7)))
#define TSB_RMC0_RSTAT_RMCRLDR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC0->RSTAT,7)))
#define TSB_RMC0_RSTAT_RMCEDIF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC0->RSTAT,12)))
#define TSB_RMC0_RSTAT_RMCDMAXIF             (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC0->RSTAT,13)))
#define TSB_RMC0_RSTAT_RMCLOIF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC0->RSTAT,14)))
#define TSB_RMC0_RSTAT_RMCRLIF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC0->RSTAT,15)))
#define TSB_RMC0_FSSEL_RMCCLK                (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC0->FSSEL,0)))

#define TSB_RMC1_EN_RMCEN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->EN   ,0)))
#define TSB_RMC1_EN_I2RMC                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->EN   ,1)))
#define TSB_RMC1_REN_RMCREN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->REN  ,0)))
#define TSB_RMC1_RCR2_RMCPHM                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->RCR2 ,24)))
#define TSB_RMC1_RCR2_RMCLD                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->RCR2 ,25)))
#define TSB_RMC1_RCR2_RMCEDIEN               (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->RCR2 ,30)))
#define TSB_RMC1_RCR2_RMCLIEN                (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->RCR2 ,31)))
#define TSB_RMC1_RCR4_RMCPO                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->RCR4 ,7)))
#define TSB_RMC1_RSTAT_RMCRLDR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC1->RSTAT,7)))
#define TSB_RMC1_RSTAT_RMCEDIF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC1->RSTAT,12)))
#define TSB_RMC1_RSTAT_RMCDMAXIF             (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC1->RSTAT,13)))
#define TSB_RMC1_RSTAT_RMCLOIF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC1->RSTAT,14)))
#define TSB_RMC1_RSTAT_RMCRLIF               (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC1->RSTAT,15)))
#define TSB_RMC1_FSSEL_RMCCLK                (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC1->FSSEL,0)))

/* Analog-to-Digital Converter (AD) */
#define TSB_AD_MOD0_ADS                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD0 ,0)))
#define TSB_AD_MOD0_SCAN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD0 ,1)))
#define TSB_AD_MOD0_REPEAT                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD0 ,2)))
#define TSB_AD_MOD0_ADBFN                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->MOD0 ,6)))
#define TSB_AD_MOD0_EOCFN                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->MOD0 ,7)))
#define TSB_AD_MOD1_ADSCN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1 ,5)))
#define TSB_AD_MOD1_I2AD                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1 ,6)))
#define TSB_AD_MOD1_VREFON                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1 ,7)))
#define TSB_AD_MOD2_HPADCE                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD2 ,5)))
#define TSB_AD_MOD2_ADBFHP                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->MOD2 ,6)))
#define TSB_AD_MOD2_EOCFHP                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->MOD2 ,7)))
#define TSB_AD_MOD3_ADOBSV0                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD3 ,0)))
#define TSB_AD_MOD3_ADOBIC0                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD3 ,5)))
#define TSB_AD_MOD5_ADOBSV1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD5 ,0)))
#define TSB_AD_MOD5_ADOBIC1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD5 ,5)))

/* Key on Wake Up (KWUP) */
#define TSB_KWUP_CR0_KEY0EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_KWUP->CR0 ,0)))
#define TSB_KWUP_CR0_DPE0                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_KWUP->CR0 ,7)))
#define TSB_KWUP_CR1_KEY1EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_KWUP->CR1 ,0)))
#define TSB_KWUP_CR1_DPE1                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_KWUP->CR1 ,7)))
#define TSB_KWUP_CR2_KEY2EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_KWUP->CR2 ,0)))
#define TSB_KWUP_CR2_DPE2                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_KWUP->CR2 ,7)))
#define TSB_KWUP_CR3_KEY3EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_KWUP->CR3 ,0)))
#define TSB_KWUP_CR3_DPE3                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_KWUP->CR3 ,7)))
#define TSB_KWUP_PKEY_PKEY0                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_KWUP->PKEY,0)))
#define TSB_KWUP_PKEY_PKEY1                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_KWUP->PKEY,1)))
#define TSB_KWUP_PKEY_PKEY2                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_KWUP->PKEY,2)))
#define TSB_KWUP_PKEY_PKEY3                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_KWUP->PKEY,3)))
#define TSB_KWUP_INT_KEYINT0                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_KWUP->INT ,0)))
#define TSB_KWUP_INT_KEYINT1                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_KWUP->INT ,1)))
#define TSB_KWUP_INT_KEYINT2                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_KWUP->INT ,2)))
#define TSB_KWUP_INT_KEYINT3                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_KWUP->INT ,3)))

/* Watchdog Timer (WD) */
#define TSB_WD_MOD_RESCR                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,1)))
#define TSB_WD_MOD_I2WDT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,2)))
#define TSB_WD_MOD_WDTE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,7)))

/* Real Time Clock (RTC) */
#define TSB_RTC_MONTHR_MO0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_RTC->MONTHR,0)))

